{
    "https://ai.meng.duke.edu/contact": "Contact Us | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Contact Us EMAIL CONTACTS Admissions Inquiries: pratt_masters@duke.edu Industry Relations: pratt_industry@duke.edu Academics/Curriculum: amanda.jolley@duke.edu Faculty Directory » Not sure who to contact? Email amanda.jolley@duke.edu for assistance. MAILING ADDRESS Duke Master of Engineering in Artificial Intelligence Program 213 Teer Building Box 90271 Durham, North Carolina 27708-0271 USA ACADEMIC COORDINATOR Amanda Jolley 209A Hudson Hall +1 919-660-5784 amanda.jolley@duke.edu ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/why-duke/tech-leaders": "What Tech Leaders Are Saying | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply What Tech Leaders Are Saying About Duke's AI Master of Engineering “There is a growing need for engineers with domain knowledge plus machine learning skills, and Duke’s AI for Product Innovation master's and certificate programs help address that need with its focus on developing leaders who can apply advanced analytics to create new products & services.” ADNAN HAIDER ASSOCIATE PARTNER, ADVANCED ANALYTICS & AI, IBM 2008 DUKE ENGINEERING MASTER'S GRADUATE “The strength of Duke’s reputation in AI and Machine Learning, combined with the focus on applying these technologies to solve the world’s big challenges in healthcare, retail, energy and beyond, make Duke the logical choice for someone interested in pursuing education in this space.” TARUN THAPAR SENIOR PRODUCT MANAGER-PERSONALIZATION, WAYFAIR 2015 Duke Engineering Master's Graduate Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/pramod-singh": "Pramod Singh | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Pramod Singh Adjunct Associate Professor in the Engineering Graduate and Professional Programs Dr. Pramod Singh is a distinguished and award-winning analytics and data science leader with over 25 years of global experience across diverse industries. As the former Chief Analytics Officer and Vice President of Data Sciences and Analytics at Envestnet | Yodlee (April 2015- Oct 23), he led teams of data scientists, analytics engineers, and business analysts, driving the development and implementation of cutting-edge analytics solutions that significantly contributed to organizational growth. Notably, he implemented an enterprise analytics platform integrating Big Data stack and Cloud compute capabilities, resulting in a remarkable 3x revenue growth over a 5-year period. Currently serving as an Adjunct Associate Professor at both the Pratt School of Engineering, Duke University, Dr. Singh is dedicated to educating and mentoring future leaders in analytics and data science. His expertise encompasses decision science technologies, covering both structured and unstructured data, as well as machine learning and artificial intelligence. Driven by a passion for innovation, he consistently delivers solutions that drive tangible business results. Prior to his tenure at Envestnet | Yodlee, Pramod spent 15 years at Hewlett Packard, where he led the digital and big data analytics practice and was first Distinguished Technologist of Advance Analytics. Analytics efforts led by him resulted in incremental revenue of more than $1B. He made significant contributions early in his career at Wal-Mart's Information Systems team, notably in the development of the Assortment Planning system which revolutionized assortment planning and still in use. Recognized as a thought leader, Dr. Singh serves on advisory boards and has received numerous industry and academic awards. His insights have been published in prestigious periodicals and journals, and he is a sought-after speaker at global conferences. Dr. Singh holds a PhD and Master's degree in Mathematics from the University of Arkansas, supplemented by an MBA in Marketing from the University of Jammu. Appointments and Affiliations Adjunct Associate Professor in the Engineering Graduate and Professional Programs Contact Information Email Address: pramod.singh@duke.edu Education Ph.D. University of Arkansas, Fayetteville, 2004 M.S. University of Arkansas, Fayetteville, 1996 M.B.A. University of Jammu (India), 1992 Courses Taught AIPI 549: Capstone Practicum 1 ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/news/shining-spotlight-shyamal-anadkat22": "Shining a Spotlight On: Shyamal Anadkat'22 | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Shining a Spotlight On: Shyamal Anadkat'22 May 27, 2022 Duke AIPI graduate sets sights on the future, changing the world for the better with AI Shyamal Anadkat Shyamal Anadkat is finishing his Duke Artificial Intelligence and Product Innovation Master of Engineering with a graduate certificate in Innovation and Entrepreneurship. “What the caterpillar calls the end, the rest of the world calls a butterfly.” Lao Tzu His list of accomplishments is impressive—he delivered an inspirational and moving speech at his Class of 2022 hooding ceremony , reflecting the hard work, grit, determination, curiosity, and consistency he has applied to all aspects of his life. As he stands on the precipice of the next chapter in his life, he is as dedicated as ever to using what he has learned in Duke's AIPI master's program to serve his surrounding community and change people’s lives for the better. He took time out of his busy schedule to talk about the journey to Duke and his love of the outdoors, and to give some advice to incoming Duke AIPI students. Tell us a little bit about yourself and your background I grew up in Rajkot, India, the city that was also home to Mahatma Gandhi. Rajkot is an entrepreneurship-driven community, and entrepreneurship runs in my family. My father and my grandfather ran their own businesses, which contributed to my entrepreneurial spirit. Growing up, I was fascinated by math and physics and was fascinated by magnets and robotics. Engineering came naturally to me, and my family supported and nurtured my curiosity and love of these two subjects. I decided to attend school for my undergraduate degree in Madison, Wisconsin, which was a big shock, especially my first winter there. I loved the city, though, and the surrounding town was beautiful. I double-majored in computer science and computer engineering, which led to human-computer interaction research projects. I also worked on a research project relating to Astrobotany, which is studying plant interactions in space. My first internship was with a FinTech company in New York City. I fell in love with programming and solving new problems. In 2017, I completed an internship at Grubhub, which has been a pioneer in the food delivery industry. Looking back to my childhood, this all started with a passion for math and physics and growing up in an environment that supported my interests and curiosities. Where do you see yourself in five years? I don’t have a specific job title or company in mind, but I see myself growing professionally as an engineer, an entrepreneur, and an AI enthusiast. My lifelong goal is to build a long-lasting impact on my surrounding community, wherever that may be, and help make people’s lives easier. I am always brainstorming solutions to everyday problems with the intent of giving back by way of using my skills to build products that will change people’s lives. Is there anything you will miss about graduate school? I will definitely miss the freedom and flexibility to take classes that I am interested in and the ability to explore my curiosity. The program encourages students to deep dive into what interests them, and I will miss being in this environment where that is strongly encouraged. I will also miss living around the campus and collaborating with my peers and faculty members. I have made long-lasting friendships, and this whole experience has been an enriching and satisfying event in my life. Lastly, but maybe most importantly, I will miss the student discounts! How do you de-stress from the pressure of school? I love spending time in nature, and I try to hike or run around the Duke pond and the Duke Forest trail. I find that spending time in nature is very satisfying and soothing. I also make time to meditate at home and reflect. When I find I have something on my mind, journaling is a great way to get ideas and thoughts out onto paper. I also enjoy playing tennis. I am a big proponent of physical exercise and how this helps manage stress. If you could do the program all over again, is there anything you would change? The program is so well-designed and executed, that I wouldn’t change anything about the classes or program, per se. If I could go back, I would have done one more elective or class in the Fall instead of taking more classes in the Spring, which would open some free time for activities. Also, I would love to have done one more semester of school to cover all my interests and to take additional electives. Jon Reifschneider is an outstanding individual and mentor. You can tell he took the time to curate and execute a well-designed, industry-focused Duke AIPI program that challenges you and prepares you for the professional world. Which course was your favorite, and why? I have two favorite classes that I would love to talk about. The first is AIPI 540: Building Products and Deep Learning with Jon Reifschneider. This class was very well structured in that we produced some great projects in a short time and focused on practical, hands-on applications. As a result, we were able to build a solid portfolio. Not only did this class help me think of new ideas, but I also used the new resources and tools needed to be successful. These high-fidelity projects, which are based on theory and state-of-the-art research, provided an opportunity for independent work and real-world application. These projects were structured to mirror the industry, so managing time and presenting in a way that the audience understands was paramount. My second favorite class was MENG 540: Management in High-Tech Industries with Professor Edward Marshall. Professor Marshall served as an amazing mentor and guided us through the leadership traits necessary to become successful managers. We also learned the importance of building your own leadership brand, which requires collaboration, trust, and ownership in projects and in life in general. This was an eye-opening class for me, and there were many valuable lessons on learning about yourself, and how to become a good manager and leader in a high-tech industry. I appreciated the fact that we were given time to reflect on our purpose and values. We focused on self-reflection and self-management, which are keys to success. Name a few things on your bucket list I would love to spend some time in the Himalayas for a few months to reflect, hike, and do other outdoor activities. I would also love to learn all I could about the local culture and crafts. My second bucket list item is to travel to a remote place with a few books and journals and spend time away from all the worldly devices to self-reflect. I have always wanted to try wakeboarding. I also have a goal to create a nonprofit trust in honor of my late father to help communities in need in my home and around India. He spent his life in service to the community around him, and I feel this would be a wonderful way to honor his memory. What’s the most spontaneous thing you’ve done? A: I went on a cruise to Cancun and had the chance to jump off the ship into the middle of the ocean. I felt like this was not something that would happen again, so I took a chance and decided to jump. There was another occasion during my undergrad time, a friend of mine and I booked a sky diving trip at the last minute and drove to this little town and jumped out of a plane. What three pieces of advice would you give to the incoming Duke AIPI class? I feel like my graduation speech is an accurate reflection of my advice to the incoming AIPI class—be curious, be consistent, and embrace change. Ask good questions to yourself as well as to others. Decide what you want from the program and be curious. Curiosity manifests itself in the questions you ask. Make time to reflect on what interests you, and don’t worry about what everyone else is interested in. This is especially true with elective classes. Be open to other students’ interests, but don’t take electives because everyone else is taking the same class. Make sure you give space for your interests. Be consistent with your goals and what you want to get out of the program. Be sure to manage your time effectively, especially with projects and use the projects to build your portfolio and brand. Another important trait is embracing change and being adaptable. While in school and in life, you are going to face professional and personal hurdles. Be open to change in an optimistic way and use this time in graduate school as a playground to experiment with interests. ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/leadership": "Leadership | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Leadership Director Jon Reifschneider Director, AI for Product Innovation Master of Engineering Program jon.reifschneider@duke.edu Steering Committee Lawrence Carin Professor of Electrical and Computer Engineering +1 919 525 1088 lcarin@ee.duke.edu Yiran Chen John Cocke Distinguished Professor of Electrical and Computer Engineering +1 919 660 1372 yiran.chen@duke.edu Brad Fox Exec Dir, Professional Masters Prgms +1 919 660 5516 brad.fox@duke.edu Jeffrey Glass Hogg Family Director of Engineering Management and Entrepreneurship +1 919 452 7158 jeff.glass@duke.edu Partner with Us Engage with us to drive your organization forward Continuing Education for Working Professionals Research Partnerships Student Projects and Consulting Recruiting Industry Advisory Boards More about Duke Engineer's Institute for Enterprise Engineering » ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/brinnae-bent": "Brinnae Bent | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Brinnae Bent Adjunct Assistant Professor in the Engineering Graduate and Professional Programs I am currently an adjunct faculty member in Artificial Intelligence at Duke University and an AI/ML researcher. As a leader in bridging the gap between research and industry in machine learning, I have led projects and developed algorithms for the largest companies in the world. More importantly, I have built algorithms that have meaningful impacts - from helping people walk to noninvasively monitoring glucose. Learn more: https://runsdata.org Appointments and Affiliations Adjunct Assistant Professor in the Engineering Graduate and Professional Programs Contact Information Email Address: brinnae.bent@duke.edu Websites: Personal Website Digital Biomarker Discovery Pipeline Education Ph.D. Duke University, 2021 M.S. Duke University, 2018 B.S. North Carolina State University, 2016 Courses Taught AIPI 540: Deep Learning Applications Representative Publications Grzywinski, R; D'Arcy, J; Naidoff, R; Shukla, A; Browne, A; Gibbons, R; Bent, B, Releasing the CRaQAn (Coreference Resolution in Question-Answering): An open-source dataset and dataset creation methodology using instruction-following models (2023) [ abs ]. Hammond, WE; Bent, B; West, VL, Goodbye Electronic Health Record? , Stud Health Technol Inform, vol 298 (2022), pp. 107-111 [ 10.3233/SHTI220917 ] [ abs ]. Robison, J; Gibbons, R; Achelis, D; Bent, B; Wajda, D; Webster, R, Augmenting gait in a population exhibiting foot drop with adaptive functional electrical stimulation (2022) [ 10.1101/2022.04.27.22273623 ] [ abs ]. Cho, PJ; Yi, J; Ho, E; Shandhi, MMH; Dinh, Y; Patil, A; Martin, L; Singh, G; Bent, B; Ginsburg, G; Smuck, M; Woods, C; Shaw, R; Dunn, J, Demographic Imbalances Resulting From the Bring-Your-Own-Device Study Design. , JMIR Mhealth Uhealth, vol 10 no. 4 (2022) [ 10.2196/29510 ] [ abs ]. Weitz, A; Colucci, L; Primas, S; Bent, B, InfiniteForm: A synthetic, minimal bias dataset for fitness applications (2021) [ abs ]. ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/news/new-masters-degree-applies-ai-product-innovation": "Duke's New Master’s Degree Applies AI to Product Innovation | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Duke's New Master’s Degree Applies AI to Product Innovation September 13, 2020 The industry-focused Master of Engineering program launches at Duke in Fall 2021 with both online and on-campus options Increases in computing power, storage capacity and research funding are fueling a dramatic evolution of artificial intelligence (AI) and expanding the field beyond university research and large tech companies. In every industry, from biomedical to aerospace, engineering teams are integrating AI into products and systems. Duke University’s Pratt School of Engineering is launching a new graduate degree program to address the talent gap created by this remarkable growth. Beginning in fall 2021, Duke Engineering’s Master of Engineering in Artificial Intelligence for Product Innovation will equip early-career engineers and scientists with the skills to bring artificial intelligence innovation to product and service development. The degree can be completed within 12 months, and is expected to attract early-career engineers and scientists from diverse fields Duke Engineering’s world-class machine-learning research, strong interdisciplinary environment, and close industry relations uniquely position the school to prepare high-potential future AI leaders. “The strength of Duke’s reputation in AI and Machine Learning, combined with the focus on applying these technologies to solve the world’s challenges in healthcare, retail, energy and beyond, make Duke the logical choice for someone interested in pursuing education in this space,” said Tarun Thapar , senior product manager-personalization with Wayfair and 2015 Duke engineering master’s graduate. The new program is guided by a cross-departmental steering committee of faculty experts in the theory and application of AI, together with an advisory board of AI leaders from diverse industries to ensure the program continues to evolve along with industry needs. The program’s director, Jon Reifschneider, joined Duke from the analytics company DTN, where he was senior vice president overseeing development of advanced predictive analytics products upon which major U.S. energy and transportation providers rely. Reifschneider’s background gives him an excellent vantage point on the value of the new degree program. “ The strength of Duke’s reputation in AI and Machine Learning, combined with the focus on applying these technologies to solve the world’s challenges in healthcare, retail, energy and beyond, make Duke the logical choice for someone interested in pursuing education in this space.\" Tarun Thapar, '15 senior product manager-personalization for Wayfair What Tech Leaders are Saying » “What sets our new AI for Product Innovation program apart is the unique combination of education in AI theory and implementation coupled with a strong focus on hands-on learning about applications of AI within industries such as health care and energy,” he said. “We designed our curriculum from the ground up with significant input from industry partners and structured our novel core course sequence around the product development process, providing students a strong foundation in the technical aspects of AI but also an understanding of the business, legal and ethical context in which the technology is applied. Our students complete their experience with a two-semester industry capstone project, enabling them to gain deep experience in applying AI within their field of interest.” The new program can be completed within 12 months and is expected to attract early-career engineers and scientists from diverse fields who want to leverage AI to make a greater impact in their industry. It is, however, also accessible to participants from technical fields who may not have an extensive prior computing background. Through the course of the program, students will develop a strong understanding of both the theory and hands-on implementation of machine learning and AI. Online students will have access to the same faculty and courses as Duke students on campus In addition to the full-time on-campus master’s program, Duke Engineering is launching an online version of the degree. Professionals who want to continue working while pursuing graduate education will have access to the same faculty and courses as students in the on-campus equivalent. “We are seeing significant growth in demand among working professionals for online education in major interdisciplinary technology areas such as AI,” said Jeff Glass, the senior associate dean for education and learning innovation at Duke Engineering. “We have responded to this high level of interest through the introduction of online versions of our new master’s programs in AI, Financial Technology (FinTech), and Cybersecurity, which offer flexibility while preserving the same intimate, tailored, world-class educational experience valued by our on-campus students.” The Duke Master of Engineering in AI for Product Innovation program is now accepting applications for August 2021 . Learn more and apply ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/apply": "How to Apply | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply How to Apply Thank you for your interest in our program! Our program uses a rolling admissions process that evaluates applications as they are submitted and returns decisions in a timely manner. Find out how to apply and see our schedule of application deadlines below. If you have questions, please contact our Admissions team at pratt_masters@duke.edu . Applicant Requirements Master of Engineering Program The Duke AI Master of Engineering (MEng) program is designed to be accessible to participants from a variety of engineering and science backgrounds. Applicants should have: An undergraduate degree in science or engineering (or equivalent technical work experience if your degree is in a non-technical field), and A minimum of one (1) semester of programming (any language), and Sufficient DUOLINGO, IELTS, or TOEFL English Language Testing scores (official result required; international students only), and Two (2) semesters of calculus Prior coursework in probability and statistics and linear algebra is highly encouraged, but not required for admission. Graduate Certificate Program The Duke AI Foundations for Product Innovation Graduate Certificate is designed for working professionals with a technical or scientific background. Participants are expected to be working full-time while completing the Certificate program. Applicants should have: An undergraduate degree in science or engineering (or equivalent technical work experience if your degree is in a non-technical field), and A minimum of one (1) semester of programming (any language), and Sufficient DUOLINGO, IELTS, or TOEFL English Language Testing scores (official result required; international students only), and Two (2) semesters of calculus International applicants - please note that this standalone certificate program does not qualify students for US visa sponsorship. Application Checklist Application Fee US$75 Paid by credit card with your application. Fee waivers » Documentation of your Bachelor's Degree, in engineering or science from an accredited institution : Transcripts (or, for institutions not using a 4.0 system, estimated GPA and grade scale ) Other Items: Short Answer Essays Resume Three (3) Recommendations Video Introduction International Applicants: English Language Testing official results Optional for 2024 Applicants: Graduate Record Exam (GRE) official results, or equivalent exam Deadlines For Fall Entry The Artificial Intelligence Master of Engineering and Graduate Certificate programs review applications on a rolling basis. Applications submitted earlier than the deadlines listed below will likely receive an earlier response. ON-CAMPUS Master of Engineering For Application Round Applications Received by Receive Decision Notification by With Reply Required by 1 January 15 March 15 April 15 2 March 15 April 15 May 1 ONLINE Master of Engineering For Application Round Applications Received by Receive Decision Notification by With Reply Required by 1 January 15 March 15 April 15 2 April 15 May 15 June 1 ONLINE Certificate Program For Application Round Applications Received by Receive Decision Notification by With Reply Required by 1 January 15 March 15 April 15 2 April 15 May 15 June 1 Start Your Application Click to create a Duke OneLink account and begin the online application: Start Application Enrolling students are required to pay a deposit. More Information >> ANNUAL SECURITY AND FIRE SAFETY REPORTS The Annual Security Report and Annual Fire Safety Report include institutional policies concerning campus safety and security, as well as statistics for the previous three years concerning reported crimes that occurred on Duke University property and on public property adjacent to campus and fires that have occurred in residence halls. A copy of these reports can be obtained by contacting the Duke Police Department at 684-4602 or writing to 502 Oregon Street, Durham, NC 27708 or by accessing: police.duke.edu/news-stats/clery ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/brad-fox": "Brad Fox | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Brad Fox Exec Dir, Professional Masters Prgms Associate Dean, Engineering Master’s Programs Executive Director, Institute for Enterprise Engineering Co-chair, Provost’s Committee: Master’s Advisory Council Dr. Fox joined Duke University in 2003. He is the associate dean of master's programs and executive director of the Institute for Enterprise Engineering in the Pratt School of Engineering at Duke. He earned his B.S. in Materials Engineering from Virginia Tech and his Ph.D. in Materials Science from the University of Virginia. At the University of Virginia, he was awarded the Allan Talbott Gwathmey Memorial Award for the best dissertation in the physical sciences. After graduation, he worked for IBM, Kobe Steel and General Electric in all phases of the technology lifecycle, including the development of novel electronic devices, the development of next-generation memory chips, and the implementation of technology to reduce manufacturing costs. He has been awarded 5 U.S. patents and published 25 articles and three book chapters. He is a certified Six Sigma Black Belt and contributed to GE’s Design for Six Sigma Book of Knowledge. At Duke, he has taught engineering project management and has overseen numerous experiential learning projects as part of the Engineering Management Practicum. In 2011, he was awarded the 2011 IEEE Technology Management Council's Engineering Management Educator of the Year Award. He has served on the Masters Advisory Council since 2010 and has served as co-chair since 2012. During his time at Duke, he has worked to launch a number of academic programs including the master of engineering degree, Duke Master of Engineering Management Online (Duke MEM Online), as well as master of engineering specializations in FinTech, Cybersecurity; Game Design, Development & Innovation; and Design Thinking & Technological Innovation. Appointments and Affiliations Exec Dir, Professional Masters Prgms Contact Information Office Location: 3405A Fitzpatrick Center, Durham, NC 27708 Office Phone: +1 919 660 5516 Email Address: brad.fox@duke.edu Courses Taught EGRMGMT 501: Engineering Management Seminar ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/why-duke/career-services": "Career Services | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Career Services Preparing Master of Engineering students for success Master of Engineering students at Duke can take advantage of the university-wide programs, events and support provided by the Duke Career Center . They are also supported by a dedicated Duke Engineering Master's Career Services & Professional Development (CSPD) team housed within the Pratt School of Engineering. The CSPD prepares students for success in the world of work, particularly within technical companies. Services provided by the team include: Individual and group coaching Workshops and events Networking opportunities Access to recruitment events Access to interview preparation and recruiting software platforms Additionally, the Master of Engineering in Artificial Intelligence program organizes its own interview preparation events throughout the year to prepare students for the unique aspects of ML and data science interviews. More about Career Services Where our graduates go » Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/richard-telford": "Richard Dean Telford | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Richard Dean Telford Executive in Residence in the Engineering Graduate and Professional Programs Ric is an Executive-in-Residence and Adjunct Associate Professor in the Pratt School of Engineering. He teaches both technology and business courses with an emphasis on entrepreneurship and helping students who share a passion for innovation. Ric also is the Director of the Center for Mobile Application Development, which assists students and faculty in developing iPhone and iPad apps. As a former IBM executive with 32 years experience, Ric tended to be at the forefront of emerging technologies with ability for understanding the value in new technologies from a business perspective. Appointments and Affiliations Executive in Residence in the Engineering Graduate and Professional Programs Contact Information Office Location: 101 Science Drive, Box 90271, Durham, NC 27708-0271 Office Phone: +1 919 613 6989 Email Address: ric.telford@duke.edu Education B.S. Trinity University, 1983 Courses Taught MENG 570: Business Fundamentals for Engineers ECE 899: Special Readings in Electrical Engineering ECE 564: Mobile Application Development ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/": "Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Become a leader in applying AI & machine learning Artificial intelligence is creating immense opportunities across every industry. Duke’s unique, immersive Master of Engineering in Artificial Intelligence for Product Innovation program will prepare you with strong technical AI skills complemented by a product design perspective and hands-on practical experience building AI software applications that solve real-world problems. Duke AI Master of Engineering Study AI and Machine Learning at Duke Master's Degree 30-credit degree program Complete in as little as 12 months Online or on-campus Gain expertise in machine learning and AI Build a project portfolio Degree Details Certificate 4-course online graduate program Complete part-time in just 15 months 100% online Ideal for working professionals Gain new skills in AI and machine learning Certificate details Is Duke AI Right for You? Consider applying if you are an: Engineering, science or computer science graduate Of any accredited institution, who wants to develop innovative products and systems using machine learning and AI Ambitious working professional Looking for an online degree that will provide valuable new skills and advance your career Undergraduate at Duke Interested in AI / Machine Learning and the benefits of the 4+1: Bachelor’s + Master’s program More about The Duke Difference » News Feb 09, 2024 | Duke Today The AI Explosion, Explained Dec 19, 2023 | Duke Engineering Inaugural Generative AI Hackathon Launches Imaginations Nov 29, 2023 | Duke Research Blog Putting Stronger Guardrails Around AI View all news ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » 2-3 semesters full-time study or 24 months part-time online 8 technical courses provide in-demand knowledge and skills 2 business courses develop leadership and management skills 1 capstone project provides real-world experience and builds your portfolio © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/jeffrey-ward": "Jeffrey D Ward | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Jeffrey D Ward Associate Dean for Technology and Innovation in the Duke Law School Jeff Ward is Clinical Professor of Law and currently teaches Contracts and technology-focused courses such as Frontier AI & Robotics: Law & Ethics and Data Governance . He is affiliated faculty at the Initiative for Science & Society and at Duke’s Pratt School of Engineering where he teaches Legal, Legal, Societal & Ethical Implications of AI for Artificial Intelligence for Product Innovation Master of Engineering students and Intellectual Property, Business Law, and Entrepreneurship for Master of Engineering Management students. Through his work at Duke and as a Faculty Associate at the Berkman Klein Center for Internet & Society at Harvard University, Ward focuses his scholarship and professional activities on the law and policy of emerging technologies, the future of lawyering, and the socio-economic effects of rapid technological change, with a focus on ensuring equitable access to the tools of economic growth and the resources of the law. In all his work on ethical technology development, he focuses on facilitating structures to allow diverse communities of stakeholders to have a voice in their socio-technical futures and on breaking down the habitual walls of law to seek inspiration and engagement from other viewpoints and disciplines. As Director of the Duke Center on Law & Technology (DCLT), Ward collaborates with DCLT affiliates to ensure that new technologies ultimately empower and ennoble all people and expand access to quality legal services. The DCLT offers programs such as: the Duke Law Tech Lab , a pre-accelerator program focused on justice tech companies—“those that create technology solutions to help people navigate legal matters with tech solutions that foster hope, independence, and self-empowerment and contribute to a fairer legal system” (definition by Justice Tech Association, 2022). Duke Law By Design , a program to help students and Duke’s community partners to employ human-centered design methodologies and available technologies to create tools and processes to enhance access to legal services. The Digital Governance Design Studio , which builds legal and governance models, develops interactive trainings, and pursues research at the intersection of governance, technology, and advice, helping students become digital-savvy professionals, collaborators, and stewards. Duke LawNext – a range of programs focused on the digital transformation and ongoing innovation of legal operations and legal services delivery. Prior to serving as director of the DCLT, Ward was director of the Start-Up Ventures Clinic, supervising attorney in the Law School’s Community Enterprise Clinic, and an associate with the Chicago office of Latham & Watkins, where he focused on M&A and capital markets transactions and served as a Public Interest Law Initiative Fellow with the at the Community Economic Development Law Project of the Chicago Lawyers’ Committee for Civil Rights Under Law, Inc. Ward earned both his JD and his LLM in International & Comparative Law from Duke Law School, his MA in Literature from Northern Illinois University, and his BA in the Program of Liberal Studies (Great Books) and a concentration in Philosophy, Politics, & Economics from the University of Notre Dame. Before turning to the law, Ward worked first as a business consultant with a global management-consulting firm in Chicago and then as an English teacher in the Chicago suburbs. Ward was the recipient of Duke Law’s 2022 Distinguished Teaching Award. Appointments and Affiliations Clinical Professor of Law Associate of the Duke Initiative for Science & Society Contact Information Office Location: Duke Law School 210 Science Dr, Duke Box 90362, Durham, NC 27708 Office Phone: +1 919 613 7153 Email Address: ward@law.duke.edu Websites: See the Duke Law profile page Education J.D. Duke University, 2009 Courses Taught LAW 640: Independent Research LAW 592: Frontier AI & Robotics: Law and Ethics LAW 571: Future of Contracts LAW 475A: Health Data and Learning Health Networks LAW 130: Contracts EGRMGMT 520: Intellectual Property, Business Law, and Entrepreneurship BIOETHIC 703: Frontier AI & Robotics: Law and Ethics BIOETHIC 700: Research Independent Study in Bioethics and Science Policy BIOETHIC 675S: Law and Policy Lab: Data Governance BIOETHIC 591: Topics in Science Policy AIPI 560: Legal, Societal, and Ethical Implications of AI In the News Is It Time to Regulate Social Media? Knight Foundation to Fund Duke Study (Nov 5, 2019 | Sanford School of Public Policy) Innovation Incubator: Duke Law Stakes Out Leadership Role in Law and Technology (Jul 20, 2017 | Duke Law Magazine) Duke law faculty offer 4 steps toward fixing college athletics (Apr 14, 2014 | The News & Observer) Representative Publications Ward, J, Foreword: Black Box Artificial Intelligence and the Rule of Law , Law and Contemporary Problems, vol 84 no. 3 (2021), pp. i-v [ abs ]. Ward, J; Kouser, T, Health-Related Digital Autonomy: An Important, But Unfinished Step , American Journal of Bioethics, vol 21 no. 7 (2021), pp. 31-33 [ abs ]. Ward, J; Reyes, C, Digging into Algorithms: Legal Ethics and Legal Access , Nevada Law Journal, vol 21 no. 1 (2020), pp. 325-377 [ abs ]. Ward, J, 10 Things Judges Should Know About AI , Judicature, vol 103 no. 1 (2019), pp. 12-18 [ abs ]. Ward, J, When and How Should We Invite Artificial Intelligence Tools to Assist With the Administration of Law? A Note From America , Australian Law Journal, vol 93 no. 3 (2019) [ abs ]. ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/noah-gift": "Noah Gift | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Noah Gift Adjunct Associate Professor in the Pratt School of Engineering Noah Gift lectures at MSDS , at Northwestern, Duke MIDS Graduate Data Science Program , and the Graduate Data Science program at UC Berkeley and the UC Davis Graduate School of Management MSBA program, and UNC Charlotte Data Science Initiative . He is teaching and designing graduate machine learning, A.I., Data Science courses, and consulting on Machine Learning and Cloud Architecture for students and faculty. These responsibilities include leading a multi-cloud certification initiative for students. Noah is a Python Software Foundation Fellow . He currently holds the following industry certifications for AWS: AWS Subject Matter Expert (SME) on Machine Learning , AWS Certified Solutions Architect , and AWS Certified Machine Learning Specialist , AWS Certified Big Data Specialist , AWS Academy Accredited Instructor, AWS Faculty Ambassador. He also is certified on both the Google and Azure platform: Google Certified Professional Cloud Architect , Certified Microsoft MTA on Python . He has published over 100 technical publications including multiple books on subjects ranging from Cloud Machine Learning to DevOps. Publications appear in F orbes , IBM, Red Hat, Microsoft, O'Reilly, Pearson, Udacity, Coursera, datascience.com, and DataCamp. Workshops and Talks around the world for organizations including NASA, PayPal, PyCon, Strata , O'Reilly Software Architecture Conference, and FooCamp. As an SME on Machine Learning for AWS, he helped created the AWS Machine Learning certification. He has worked in roles ranging from CTO, General Manager, Consulting CTO, Consulting Chief Data Scientist, and Cloud Architect. This experience has been with a wide variety of companies: ABC, Caltech, Sony Imageworks, Disney Feature Animation, Weta Digital, AT&T, Turner Studios, and Linden Lab, and industries: Television, Film, Games, SaaS, Sports, Telecommunications. He has film credits in many major motion pictures for technical work, including Avatar , Spider-Man 3, and Superman Returns. He has been responsible for shipping many new products at multiple companies that generated millions of dollars of revenue and had a global scale. Currently, he is consulting startups and other companies, on Machine Learning, Cloud Architecture, and CTO level consulting as the founder of Pragmatic A.I. Labs. His most recent books are: Practical MLOps Getting your models into production is the fundamental challenge of machine learning. MLOps offers a set of proven principles aimed at solving this problem in a reliable and automated way. Publisher O'Reilly Purchase Practical MLOps Cloud Computing for Data Analysis A practical guide to Data Science, Machine Learning Engineering and Data Engineering Publisher: Pragmatic AI LabsRelease Date: (Early 2021) Purchase: Cloud Computing for Data - Book Abstract This book is designed to give you a comprehensive view of cloud computing including Big Data and Machine Learning. A variety of learning resources will be used including interactive labs on Cloud Platforms (Google, AWS, Azure) using Python. This is a project-based book with extensive hands-on assignments. Read Chapters Online Chapter00: Introduction Chapter01: Getting Started Chapter02: Cloud Foundations Chapter03: Containers, Virtualization and Elasticity Chapter04: Distributed Computing Chapter05: Cloud Storage Chapter06: Serverless ETL Chapter07: Managed ML Systems Chapter08: Data Science Case Studies Chapter09: Essays Chapter10: Career Additional Resources Source Code Cloud Computing with Python Source Code Minimal PythonPublisher: Pragmatic AI LabsRelease Date: 2020 Purchase: Minimal Python - Book All Book Bundle Monthly Subscription Abstract Even books that have “learn” in the title introduce readers to hopelessly complex topics like object-oriented programming or concurrency. It turns out YAGNI (You Ain’t Gonna Need It). Why teach students topics they won’t use either ever, or not for a few years? Read Chapters Online Chapter00: Introduction Chapter01: Execute Commands in Python Chapter02: Store Data Chapter03: Create Functions Chapter04: Test Functions Chapter05: Command Line Tools Chapter06: Build Web Apps Flask Chapter07: Data Science Pandas Chapter08: Data Science Libraries Chapter09: Get a Job in Tech Chapter10: Case Studies and War Stories Additional ResourcesSource Code Minimal Python Book Source Code Python Command Line Tools: Design powerful apps with ClickPublisher: Pragmatic AI LabsRelease Date: 2020 Purchase: Minimal Python - Book Buy a copy of the book on Kindle Buy a hard copy of the book on Amazon All Book Bundle Monthly Subscription Testing in PythonPublisher: Pragmatic AI LabsRelease Date: 2020 Purchase: Testing in Python - Book Buy a copy of the book on Kindle All Book Bundle Monthly Subscription Buy a hard copy of the book on Amazon Abstract Getting started with testing can be hard, and this book aims make it all very easy by using examples and straightforwardly explaining the process. Testing is a core principle of robust software implementations and should be a prime skill to master that can be applied to any project. Read Chapters Online Chapter01: Configuring The Environment Chapter02: Testing Conventions Chapter03: Introduction To Pytest Chapter04: Test Classes Chapter05: Reporting Chapter06: Debugging Pytest and pdb Chapter07: Pytest Fixtures Chapter08: Monkeypatching Chapter09: Testing Matrix Tox Chapter10: Continuous Integration Delivery Chapter11: Case Study War Stories Chapter12: Essays Additional Resources Source Code Testing in Python Book Source Code Python For DevOps: Learn Ruthlessly Effective Automation Publisher: O’Reilly MediaRelease Date: December 31st, 2019 Abstract Much has changed in technology over the past decade. Data is hot, the cloud is ubiquitous, and many organizations need some form of automation. Throughout these transformations, Python has become one of the most popular languages in the world. This practical resource shows you how to use Python for everyday Linux systems administration tasks with today’s most useful DevOps tools, including Docker, Kubernetes, and Terraform. Learning how to interact and automate with Linux is essential for millions of professionals. Python makes it much easier. With this book, you’ll learn how to develop software and solve problems using containers, as well as how to monitor, instrument, load-test, and operationalize your software. Looking for effective ways to “get stuff done” in Python? This is your guide. Python foundations, including a brief introduction to the language How to automate text, write command-line tools, and automate the filesystem Linux utilities, package management, build systems, monitoring and instrumentation, and automated testing Cloud computing, infrastructure as code, Kubernetes, and serverless Machine learning operations and data engineering from a DevOps perspective Building, deploying, and operationalizing a machine learning project Pragmatic AI: An Introduction to Cloud-based Machine LearningPublisher: O’Reilly MediaRelease Date: December 31st, 2019 Abstract Pragmatic AI will help you solve real-world problems with contemporary machine learning, artificial intelligence, and cloud computing tools. Noah Gift demystifies all the concepts and tools you need to get results—even if you don’t have a strong background in math or data science. Gift illuminates powerful off-the-shelf cloud offerings from Amazon, Google, and Microsoft, and demonstrates proven techniques using the Python data science ecosystem. His workflows and examples help you streamline and simplify every step, from deployment to production, and build exceptionally scalable solutions. As you learn how machine language (ML) solutions work, you’ll gain a more intuitive understanding of what you can achieve with them and how to maximize their value. Building on these fundamentals, you’ll walk step-by-step through building cloud-based AI/ML applications to address realistic issues in sports marketing, project management, product pricing, real estate, and beyond. Whether you’re a business professional, decision-maker, student, or programmer, Gift’s expert guidance and wide-ranging case studies will prepare you to solve data science problems in virtually any environment. Python for Unix and Linux System AdministrationPublisher: O’Reilly MediaRelease Date: June 2009 Python is an ideal language for solving problems, especially in Linux and Unix networks. With this pragmatic book, administrators can review various tasks that often occur in the management of these systems, and learn how Python can provide a more efficient and less painful way to handle them. Each chapter in Python for Unix and Linux System Administration presents a particular administrative issue, such as concurrency or data backup, and presents Python solutions through hands-on examples. Once you finish this book, you’ll be able to develop your own set of command-line utilities with Python to tackle a wide range of problems. Discover how this language can help you: With this book, you’ll learn how to package and deploy your Python applications and libraries, and write code that runs equally well on multiple Unix platforms. You’ll also learn about several Python-related technologies that will make your life much easier. His most recent video courses are: His most recent online courses are: You can follow Noah Gift on social media and on the web at: Chapter02: Testing Conventions Chapter03: Introduction To Pytest Chapter04: Test Classes Chapter05: Reporting Chapter06: Debugging Pytest and pdb Chapter07: Pytest Fixtures Chapter08: Monkeypatching Chapter09: Testing Matrix Tox Chapter10: Continuous Integration Delivery Chapter11: Case Study War Stories Chapter12: Essays Python Command Line Tools Book Source Code Purchase: Testing in Python - Book Buy a copy of the book on Kindle All Book Bundle Monthly Subscription Buy a hard copy of the book on Amazon Chapter02: Testing Conventions Chapter03: Introduction To Pytest Chapter04: Test Classes Chapter05: Reporting Chapter06: Debugging Pytest and pdb Chapter07: Pytest Fixtures Chapter08: Monkeypatching Chapter09: Testing Matrix Tox Chapter10: Continuous Integration Delivery Chapter11: Case Study War Stories Chapter12: Essays Testing in Python Book Source Code Buy a Physical Copy from Amazon Buy a Kindle Copy from Amazon Read Online Download Source Code from Github Python for DevOps Website Chinese Version: 學習精準有效的自動化 Buy a Physical Copy from Amazon Buy a Kindle Copy from Amazon Read Online Buy EPUB version Informit Buy Physical Book & eBook Bundle Informit Download Source Code from Github Buy Copy from Amazon Read Online Download Source Code from Github Read text files and extract information Run tasks concurrently using the threading and forking options Get information from one process to another using network facilities Create clickable GUIs to handle large and complex utilities Monitor large clusters of machines by interacting with SNMP programmatically Master the IPython Interactive Python shell to replace or augment Bash, Korn, or Z-Shell Integrate Cloud Computing into your infrastructure, and learn to write a Google App Engine Application Solve unique data backup challenges with customized scripts Interact with MySQL, SQLite, Oracle, Postgres,and SQLAlchemy Essential Machine Learning and A.I. with Python and Jupyter Notebook LiveLessons (Pearson, 2018) AWS Certified Machine Learning-Specialty (ML-S) (Pearson, 2019) Python for Data Science Complete Video Course Video Training (Pearson, 2019) AWS Certified Big Data - Specialty Complete Video Course and Practice Test Video Training (Pearson, 2019) Building A.I. Applications on Google Cloud Platform (Pearson, 2019) Pragmatic AI and Machine Learning Core Principles (Pearson, 2019) Data Engineering with Python and AWS Lambda (Pearson, 2019) Introduction to Jenkins for DevOps (Pearson, 2020) Microservices with this Udacity DevOps Nanodegree (Udacity, 2019) Command Line Automation in Python (DataCamp, 2019) AWS Certified Cloud Practitioner 2020-Real World & Pragmatic YouTube Channel: Pragmatic AI Labs www. noahgift.com Linkedin: https://www.linkedin.com/in/noahgift/ Pragmatic AI Labs Website: www.paiml.com Github Get the latest content and updates from Pragmatic AI Labs: Subscribe to the mailing list! Appointments and Affiliations Executive in Residence in the Social Science Research Institute Contact Information Email Address: noah.gift@duke.edu Websites: [Book] Pragmatic AI: An Introduction to Cloud-Based Machine Learning [Book] Python for DevOps: Learn Ruthlessly Effective Automation YouTube Channel Noah Gift Personal Website Github Education M.B.A. University of California, Davis, 2013 M.S. California State University, Los Angeles, 2003 Courses Taught IDS 793: Independent Study IDS 721: Data Analysis at Scale in Cloud IDS 706: Data Engineering Systems AIPI 561: Operationalizing AI Representative Publications Gift, N; Behrman, K; Deza, A; Gheorghiu, G, Python for DevOps: Learn Ruthlessly Effective Automation (2019) [ abs ]. Gift, N, Pragmatic AI An Introduction to Cloud-Based Machine Learning (2018) [ abs ]. Beazley, DM, Python Essential Reference (2009) [ abs ]. Gift, N; Jones, J, Python for Unix and Linux System Administration (2008) [ abs ]. ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/alfredo-deza": "Alfredo Deza | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Alfredo Deza Adjunct Assistant Professor in the Engineering Graduate and Professional Programs Alfredo Deza is a software engineer, speaker, author, and former Olympic athlete working at Microsoft in Developer Relations. He has almost two decades of DevOps and software engineering experience, and has taught several Machine Learning Engineering and DevOps courses. He has written several books about DevOps and Python including Python For DevOps and Practical MLOps for O'Reilly. Some of the areas of expertise where he can help out with content and guidance are Azure and cloud computing, DevOps, MLOps, Python, Databricks, and automation with CI/CD. Alfredo is currently leading engagements with Georgia Tech, Universidad Politecnica de Madrid, and Duke University, where he often gives guest lectures about Azure, Python, Rust, and technology in general. Appointments and Affiliations Adjunct Assistant Professor in the Engineering Graduate and Professional Programs Contact Information Email Address: alfredo.deza@duke.edu Websites: LinkedIn Profile Coursera Personal Page Education C. Newton College (Peru), 1996 Courses Taught AIPI 503: Python Bootcamp Representative Publications Gift, N; Deza, A, Practical MLOps Operationalizing Machine Learning Models (2021) [ abs ]. Deza, A; Gift, N, Testing in Python Robust Testing for Professionals (2020) [ abs ]. Gift, N; Deza, A, Minimal Python (2020) [ abs ]. Gift, N; Deza, A, Python Command Line Tools Design Powerful Apps with Click (2020) [ abs ]. Gift, N; Behrman, K; Deza, A; Gheorghiu, G, Python for DevOps: Learn Ruthlessly Effective Automation (2019) [ abs ]. ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty": "Faculty | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Faculty Director Jon Reifschneider Director, AI for Product Innovation Master of Engineering Program jon.reifschneider@duke.edu AI and Machine Learning Technical Faculty Brinnae Bent Adjunct Assistant Professor in the Engineering Graduate and Professional Programs brinnae.bent@duke.edu Xu Chen Adjunct Assistant Professor in the Pratt School of Engineering xu.chen@duke.edu Alfredo Deza Adjunct Assistant Professor in the Engineering Graduate and Professional Programs alfredo.deza@duke.edu Noah Gift Adjunct Associate Professor in the Pratt School of Engineering noah.gift@duke.edu Wann-Jiun Ma Adjunct Assistant Professor in the Engineering Graduate and Professional Programs wann.jiun.ma@duke.edu Pramod Singh Adjunct Associate Professor in the Engineering Graduate and Professional Programs pramod.singh@duke.edu Natalia Summerville Adjunct Associate Professor in the Engineering Graduate and Professional Programs summerville.natalia@duke.edu Business & Management Faculty Theodore Ryan Executive in Residence in the Engineering Graduate and Professional Programs +1 919 660 5386 theodore.ryan@duke.edu Richard Dean Telford Executive in Residence in the Engineering Graduate and Professional Programs +1 919 613 6989 ric.telford@duke.edu Law & Ethics Faculty Jeffrey D Ward Associate Dean for Technology and Innovation in the Duke Law School +1 919 613 7153 ward@law.duke.edu ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/industry": "Industry and Employer Relations | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Industry and Employer Relations Recruit or work with top talent skilled in solving problems using AI, machine learning and data analytics At Duke Engineering’s Master of Engineering in Artificial Intelligence program, we develop future technology leaders who can combine their domain expertise with an interdisciplinary set of skills in AI and machine learning to build and improve products and services. Building upon a strong engineering and science foundation, our students gain skills in three core competency areas: Theory and practice of AI and machine learning Business, legal and ethical context for developing new analytics products Specialized industry experience in applying AI via electives and capstone project We welcome organizations of all industries, types and sizes to engage with our talented students for both recruiting and to support our educational mission. Contact us for more information. Ways TO PARTNER WITH DUKE Recruit our students for internships or full-time employment Engage with a student team as a sponsor of a capstone project Speak at our weekly Industry Seminar Series or a special event Join our Industrial Advisory Board Contact Us Sue Brien Assistant Director, Employer Development and Relations 919-660-1071 susan.brien@duke.edu Jon Reifschneider Director, Master of Engineering in Artificial Intelligence jon.reifschneider@duke.edu Faculty Profile » Partner with Us Engage with us to drive your organization forward Continuing Education for Working Professionals Research Partnerships Student Projects and Consulting Recruiting Industry Advisory Boards More about Duke Engineer's Institute for Enterprise Engineering » ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu": "Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Become a leader in applying AI & machine learning Artificial intelligence is creating immense opportunities across every industry. Duke’s unique, immersive Master of Engineering in Artificial Intelligence for Product Innovation program will prepare you with strong technical AI skills complemented by a product design perspective and hands-on practical experience building AI software applications that solve real-world problems. Duke AI Master of Engineering Study AI and Machine Learning at Duke Master's Degree 30-credit degree program Complete in as little as 12 months Online or on-campus Gain expertise in machine learning and AI Build a project portfolio Degree Details Certificate 4-course online graduate program Complete part-time in just 15 months 100% online Ideal for working professionals Gain new skills in AI and machine learning Certificate details Is Duke AI Right for You? Consider applying if you are an: Engineering, science or computer science graduate Of any accredited institution, who wants to develop innovative products and systems using machine learning and AI Ambitious working professional Looking for an online degree that will provide valuable new skills and advance your career Undergraduate at Duke Interested in AI / Machine Learning and the benefits of the 4+1: Bachelor’s + Master’s program More about The Duke Difference » News Feb 09, 2024 | Duke Today The AI Explosion, Explained Dec 19, 2023 | Duke Engineering Inaugural Generative AI Hackathon Launches Imaginations Nov 29, 2023 | Duke Research Blog Putting Stronger Guardrails Around AI View all news ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » 2-3 semesters full-time study or 24 months part-time online 8 technical courses provide in-demand knowledge and skills 2 business courses develop leadership and management skills 1 capstone project provides real-world experience and builds your portfolio © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/jeffrey-glass": "Jeffrey Glass | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Jeffrey Glass Hogg Family Director of Engineering Management and Entrepreneurship Jeffrey T. Glass is a Professor in the Department of Electrical and Computer Engineering and Director of the Institute for Enterprise Engineering. He holds the Hogg Family endowed chair in Engineering Management and Entrepreneurship. Formerly, he was the Co-Director of The Institute for the Integration of Management and Engineering at Case Western Reserve University (CWRU) and held the Joseph F. Toot, Jr. endowed chair in the Case School of Engineering. Prior to these university appointments he was the Vice President of R&D for Kobe Steel USA Inc. Jeff received his Bachelors and Masters degrees from Johns Hopkins University, and a Ph.D. in Materials Science and Engineering from the University of Virginia. He also received an MBA from Duke University's Global Executive (GEMBA) program. His current research involves electronic materials and the associated devices/instruments improved by these materials. In particular, miniature mass spectrometer development and engineered systems for waste treatment are systems of focus for his lab. He is also involved in the development of joint educational, research and technology transfer activities related to the intersection of business and technology. He consults and holds advisory board appointments with various companies in materials-related areas and has served as an expert witness in patent litigation. Prior to his appointment at CWRU, he was the Vice President of R&D for Kobe Steel USA Inc. with a focus on electronic materials. Prior to joining Kobe Steel, he was a tenured faculty member in the Department of Materials Science and Engineering at North Carolina State University. He has been involved in the study of Innovation Management in technology-based organizations with a focus on the early stages of technical development and received the 2004 Industrial Research Institute’s Maurice Holland Award for his paper entitled “Managing the Ties Between Central R&D and Business Units.” Jeff's technical research has focused on the growth and characterization of thin films for electronics, including carbon nanotubes, graphene, graphenated carbon nanotubes, diamond, silicon carbide and chalcogenides. Chemical vapor deposition, sputtering, materials analysis and electronic/electrochemical properties are his areas of interest. Miniature mass spectrometers, decentralized waste treatment, smart toilets and photoelectrochemical energy conversion devices are some of the applications his lab focuses on. He has published over 175 papers and book chapters, edited seven books and is a co-inventor on 14 patents. He has been a short course instructor for several professional societies and companies and has organized numerous conferences. He has given over 75 invited presentations in 12 different countries. He served as a member of a Presidential Science Advisor's committee for the assessment of diamond technology in Japan and has received two teaching awards and the National Science Foundation Presidential Young Investigator award. He has held adjunct faculty appointments at North Carolina State University, Case Western Reserve University and the Kenan-Flagler Business School at the University of North Carolina where he has taught executive courses on Managing Innovation. Appointments and Affiliations Professor of Electrical and Computer Engineering Hogg Family Director of Engineering Management and Entrepreneurship Director of the Institute for Enterprise Engineering (IEnE) Professor in the Thomas Lord Department of Mechanical Engineering and Materials Science Core Faculty in Innovation & Entrepreneurship Associate of the Duke Initiative for Science & Society Contact Information Office Location: Packages: Hudson Hall Room 129, Office: Teer Bldg Rm 118, Durham, NC 27708 Office Phone: +1 919 452 7158 Email Address: jeff.glass@duke.edu Websites: J.T.Glass Nanomaterials and Thin Films Lab Google Scholars Web Page Masters of Engineering Management Program Education M.B.A. Duke University, 1999 Ph.D. University of Virginia, 1986 M.Sc.Eng. Johns Hopkins University, 1983 B.S.E. Johns Hopkins University, 1981 Research Interests Electronic materials and the associated devices/instruments improved by these materials, especially electrode applications in miniature mass spectrometry, energy conversion and storage and liquid waste disinfection for developing regions. Electrochemical measurements and applications of thin films, including carbon nanotubes, graphene and atomic layer deposited oxides are of particular interest Awards, Honors, and Distinctions Stansell Family Distinguished Research Award. Pratt School of Engineering. 2015 Highly Cited Researcher. Thomson Reuters. 2001 Courses Taught MSEG 591: Independent Study EGRMGMT 572: Innovation Management in Technology-Based Organizations In the News New Master’s Program Focuses on Video Games as Powerful Tool (Aug 28, 2023 | Pratt School of Engineering) Engineering Dean Bellamkonda Named Provost at Emory University; Glass to Serve as Interim Dean (Feb 16, 2021) Stretched to Eight Times Their Size, These Supercapacitors Are Ready for Your Wearable Devices (Mar 19, 2020 | Pratt School of Engineering) Toilet Paper Sabotage Isn't Stopping Progress on Project to 'Reinvent the Toilet' (Feb 17, 2020 | Pratt School of Engineering) Reinventing the Toilet (Nov 5, 2018 | Duke Stories) Duke's Community-Based Toilet System Begins Testing in India (Apr 25, 2018 | Duke Global Health Institute) Duke's Community-Based Toilet System Begins Testing in India (Apr 4, 2018 | Pratt School of Engineering) Duke, RTI International Partner on Improved Global Sanitation (Aug 28, 2017) Engineering the Toilet (May 10, 2017 | DukEngineer Magazine) Energy Initiative Awards Seven New Seed Grants (Apr 28, 2017) Coding and Computers Help Spot Methane, Explosives (Apr 14, 2016) Duke University innovation may lead to portable mass spectrometers (Apr 14, 2016 | Homeland Security Today) Duke Engineers Help Launch Off-Grid Sanitation System in India (Sep 25, 2015) Sniffing Out Gas Leaks: Pratt Researchers Work on Next-Generation Methane Detector (Feb 19, 2015) Energy deputy secretary: Duke’s innovative energy research essential to security, safety (Apr 24, 2014) Energy Initiative Provides First Round of Research Seed Funding (Apr 16, 2014) U.S. Reps Visit Federally Funded Airport Security Research at Duke (Nov 7, 2013) Representative Publications von Windheim, T; Gilchrist, KH; Parker, CB; Hall, S; Carlson, JB; Stokes, D; Baldasaro, NG; Hess, CT; Scheick, L; Rax, B; Stoner, B; Glass, JT; Amsden, JJ, Proof-of-Concept Vacuum Microelectronic NOR Gate Fabricated Using Microelectromechanical Systems and Carbon Nanotube Field Emitters. , Micromachines, vol 14 no. 5 (2023) [ 10.3390/mi14050973 ] [ abs ]. Jagannadham, K; Parker, CB; Glass, JT, The influence of light incidence on the bipolar switching in the two-terminal devices with n-ZnO and p-SrCu2O2 films , Applied Physics A: Materials Science and Processing, vol 129 no. 1 (2023) [ 10.1007/s00339-022-06292-4 ] [ abs ]. Aloui, T; Serpa, RB; Abboud, N; Horvath, KL; Keogh, J; Parker, CB; Stern, JC; Denton, MB; Sartorelli, ML; Glass, JT; Gehm, ME; Amsden, JJ, A super-resolution proof of concept in a cycloidal coded aperture miniature mass spectrometer , Rapid Communications in Mass Spectrometry (2023) [ 10.1002/rcm.9477 ] [ abs ]. Horvath, KL; Piacentino, EL; Serpa, RB; Aloui, T; Vyas, R; Zhilichev, Y; von Windheim, J; Sartorelli, ML; Parker, CB; Denton, MB; Gehm, ME; Glass, JT; Amsden, JJ, Design considerations for a cycloidal mass analyzer using a focal plane array detector. , Journal of mass spectrometry : JMS, vol 57 no. 7 (2022) [ 10.1002/jms.4874 ] [ abs ]. Serpa, RB; Piacentino, EL; Horvath, KL; Aloui, T; Zhilichev, Y; Parker, CB; Glass, JT; Tilden, SB; Keogh, JA; Kingston, R; Sperline, RP; Denton, MB; Amsden, JJ, Virtual-slit focusing in a cycloidal mass spectrometer – A proof of concept , International Journal of Mass Spectrometry, vol 470 (2021) [ 10.1016/j.ijms.2021.116706 ] [ abs ]. ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/news/shining-spotlight-eduardo-martinez": "Shining a Spotlight on: Eduardo Martinez | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Shining a Spotlight on: Eduardo Martinez March 25, 2022 AIPI Student sets his sights on San Francisco As the first cohort of Duke University’s Master of Engineering in Artificial Intelligence for Product Innovation gets set to graduate, a new adventure is only a few months away. For Eduardo, this means relocating to San Francisco where he will start a new position as a machine learning data scientist. He took some time out of his busy schedule to talk about his background, experiences in the AIPI program and his advice to future AIPI students. Q: Tell us a little bit about yourself and your background. A: Growing up, I was very active. My mom was active and from a very early age, my younger brother and I learned how to swim, played sports, and used activity to bond with her. I grew up in Guatemala and my immediate family still lives there. I would spend summers in the US with extended family, which I feel helped my transition when I moved to Durham to attend Duke University. Q: What will you miss about being in graduate school? A: I will miss being in school the most. I feel it is such a privilege to spend all your time learning something you love. Technology is so fast paced, we need to keep learning and improving. I will also miss having dedicated time to explore different topics brought up in lectures. The atmosphere on campus supports learning and exploration. It’s a very low stress environment and the campus is beautiful. Q: Which class has been your favorite and why? A: I have two favorite courses which I am taking this semester. The first is AIPI 540, Deep Learning Applications, with Jon Reifschneider. I enjoy the module structure of the course because each module has a project that is open ended, which allows us to play around with new methods. The main reason this is my favorite class is we have to tackle problems with novel ideas, and we really have to stop and ask ourselves how we can add value to this project. The second class I am taking is a Biostatistics elective, where we are learning about causal inference. The assignments and examples are a little out of my league, but I enjoy the challenge. The class focuses on clinical trials, and it can be heavy with medical terminology, but the majority of the methods used to do solid causal inference coincide with how experimentation is done in the AIPI industry. Q: If you were granted three wishes, what would you wish for? A: This question gave me some pause and I really had to think about this one. My first wish is to be two inches taller. Not much taller than I am now. My second wish is to reduce economic inequality to the extent we experience equity, and my third wish is to be able to fall asleep wherever I am, whenever I want. I have had a lot of late nights where I stay up working on projects and when I lay down, I can’t fall asleep! So that would be nice. Q: One benefit of our Enterprise Engineering programs is the wealth of industry knowledge. Can you speak to this benefit more? A: Having industry knowledge is very helpful because the assignments in the classes are hands on and we are putting the theories we learn into practice with real world problems. The faculty can present problems they have seen in industry. They offer very practical advice and ties theory into real world problems. They stress the need to deal with ambiguity and can give insight on how to deal with this. Q: If you didn’t have to sleep, what would you do with your extra time? A: I would finally learn to play the guitar and sing. I have always wanted to learn how to play the guitar and have tried a few times, but this is what I would want to learn. Q: What’s the one thing you never get bored of? A: Listening to podcasts. I love listening to podcasts and have gotten used to having a second voice in the background. Q: If you could go back and do the program all over again, what would you change? A: The program was great and there isn’t anything I would change in that regard. I would have liked to join more clubs at Duke. I was always interested in the social and cultural clubs as well as those related to the arts. In the beginning though, you aren’t sure how much time you will have, and you don’t want to over schedule yourself. Q: What three pieces of advice would you give to the incoming AIPI class? A: I would advise students to come with an open mind and be open to learning. The first semester feels like drinking from a fire hose but be open to the program curriculum, mentorship, and friendships. The second piece of advice is to not pay too much attention to what other students are doing. Try to find your own path. The third piece of advice is if you want to get into industry, apply early. Don’t wait until you are “ready”. You will never be 100% knowledgeable or ready. Once you start the process, it will push you to continue. While it is a personal journey, start early to get comfortable with tech interviews. ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/lawrence-carin": "Lawrence Carin | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Lawrence Carin Professor of Electrical and Computer Engineering Lawrence Carin earned the BS, MS, and PhD degrees in electrical engineering at the University of Maryland, College Park, in 1985, 1986, and 1989, respectively. In 1989 he joined the Electrical Engineering Department at Polytechnic University (Brooklyn) as an Assistant Professor, and became an Associate Professor there in 1994. In September 1995 he joined the Electrical and Computer Engineering (ECE) Department at Duke University, where he is now a Professor. He was ECE Department Chair from 2011-2014, the Vice Provost for Research from 2014-2019, and since 2019 he has served as Duke's Vice President for Research. From 2003-2014 he held the William H. Younger Distinguished Professorship, and since 2018 he has held the James L. Meriam Distinguished Professorship. Dr. Carin's research focuses on machine learning (ML), artificial intelligence (AI) and applied statistics. He publishes widely in the main ML/AI conferences, and he has also engaged in translation of research to practice. He was co-founder of the small business Signal Innovations Group, which was acquired by BAE Systems in 2014, and in 2017 he co-founded the company Infinia ML. He is an IEEE Fellow. Appointments and Affiliations Professor of Electrical and Computer Engineering Professor of Computer Science Contact Information Office Location: 321 Gross Hall, Durham, NC 27708 Office Phone: +1 919 525 1088 Email Address: lcarin@ee.duke.edu Websites: http://www.ee.duke.edu/~lcarin Education Ph.D. University of Maryland, College Park, 1989 M.Sc.Eng. University of Maryland, College Park, 1986 B.S.E. University of Maryland, College Park, 1985 Research Interests Applied statistics and machine learning Awards, Honors, and Distinctions Fellows. Institute for Electrical and Electronics Engineers. 2001 Courses Taught ECE 899: Special Readings in Electrical Engineering ECE 891: Internship ECE 590: Advanced Topics in Electrical and Computer Engineering In the News The AI Explosion, Explained (Feb 8, 2024 | Duke Today) A Marriage of AI and Photonics to Advance Imaging, Health Care and Public Safety (Jan 30, 2024 | Pratt School of Engineering) At Duke, the Future of Pathology Lies in AI (Jan 20, 2021 | Pratt School of Engineering) Research Week Features Hot Topics and New Tools (Jan 15, 2021) Duke Launches Center to Bring Computational Thinking to All Students (Oct 12, 2020) Duke Researchers To Begin Slowly Returning to Their Labs, With Masks (May 7, 2020) Carin Urges Faculty to Take Ownership of Research Conduct (Oct 24, 2019) Carin Named New Vice President for Research with University-Wide Responsibilities (Aug 7, 2019) Larry Carin Reappointed to New Term as Vice Provost for Research (Oct 2, 2018) +DataScience Wants to Put the Power of Machine Learning in Everyone’s Hands (Sep 28, 2018) Duke Teaming Up With Microsoft In Durham and In The Cloud (Jul 9, 2018) Webs of Minds and Ideas Bind Dukes Campus (Mar 14, 2017) Duke to discuss partnership with Indian institute of Technology (Jan 6, 2016 | Triangle Business Journal) Duke Board Updated on Academic, Financial Issues at Fall Meeting (Oct 2, 2015) Duke, RTI team for projects, fund two with $100,000 each (Mar 4, 2015 | WRAL Tech Wire) Duke names new vice provost for research (May 23, 2014 | Durham Herald-Sun) Carin Named Vice Provost for Research (May 20, 2014) Representative Publications Dow, ER; Jeong, HK; Katz, EA; Toth, CA; Wang, D; Lee, T; Kuo, D; Allingham, MJ; Hadziahmetovic, M; Mettu, PS; Schuman, S; Carin, L; Keane, PA; Henao, R; Lad, EM, A Deep-Learning Algorithm to Predict Short-Term Progression to Geographic Atrophy on Spectral-Domain Optical Coherence Tomography. , JAMA Ophthalmol, vol 141 no. 11 (2023), pp. 1052-1061 [ 10.1001/jamaophthalmol.2023.4659 ] [ abs ]. Dov, D; Elliott Range, D; Cohen, J; Bell, J; Rocke, DJ; Kahmke, RR; Weiss-Meilik, A; Lee, WT; Henao, R; Carin, L; Kovalsky, SZ, Deep-Learning-Based Screening and Ancillary Testing for Thyroid Cytopathology. , Am J Pathol, vol 193 no. 9 (2023), pp. 1185-1194 [ 10.1016/j.ajpath.2023.05.011 ] [ abs ]. Zhang, H; Wang, C; Wang, Z; Duan, Z; Chen, B; Zhou, M; Henao, R; Carin, L, Learning Hierarchical Document Graphs From Multilevel Sentence Relations. , IEEE Trans Neural Netw Learn Syst, vol 34 no. 8 (2023), pp. 4273-4285 [ 10.1109/TNNLS.2021.3113297 ] [ abs ]. Assaad, S; Dov, D; Davis, R; Kovalsky, S; Lee, WT; Kahmke, R; Rocke, D; Cohen, J; Henao, R; Carin, L; Range, DE, Thyroid Cytopathology Cancer Diagnosis from Smartphone Images Using Machine Learning. , Mod Pathol, vol 36 no. 6 (2023) [ 10.1016/j.modpat.2023.100129 ] [ abs ]. Luo, D; Xu, H; Carin, L, Differentiable Hierarchical Optimal Transport for Robust Multi-View Learning , IEEE Transactions on Pattern Analysis and Machine Intelligence, vol 45 no. 6 (2023), pp. 7293-7307 [ 10.1109/TPAMI.2022.3222569 ] [ abs ]. ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/theodore-ryan": "Theodore Ryan | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Theodore Ryan Executive in Residence in the Engineering Graduate and Professional Programs Ted has more than 40 years of experience as management consultant and coach to top-tier organizations, focusing on executive coaching and development; leadership and management development; organizational effectiveness; evaluation processes; business ethics; aligning corporate culture to strategy, mission, vision and values; and selection process development. Currently, Ted teaches the core Management and Leadership course to Master of Engineering Management/Master of Engineering students at the Pratt School of Engineering. For twelve years, he taught the business ethics course at Fuqua School of Business to daytime MBA students. Ted’s clients have included Accenture, American Museum of Natural History, Bank of America, Central Park Conservancy, Clariant Corporation, Deutsche Back, The Federal Reserve bank of New York, FHI 360, GE, Chase Bank [predecessor of JP Morgan Chase], ImageQuix, Lenovo, Mastercard, McKim & Creed, Merrill Lynch, Morgan Stanley, The New York Times, PepsiCo and the U.S. State Department. Ted’s work with these clients took place in intern Ted has created and delivered numerous leadership development programs for executives and managers at major global corporations and not-for-profits in the US, Europe, Asia and Latin America. At Morgan Stanley, Ted was the lead consultant in creating and implementing Wall Street’s first computer-driven 360 performance evaluation process. Also at Morgan Stanley, Ted created and conducted a series of offsite leadership programs, for all officers, globally, in the administrative, auditing, finance, human resources, legal, operations and systems areas. One of the core modules focused on how to create and lead effective cross-cultural teams. Ted helped deliver Bank of America’s executive leadership program to several hundred senior and high-level executives, and was the lead consultant in creating a world-class investment bank [Banc of America Securities] as a subsidiary of Bank of America. Ted led the creation of the hiring processes for Accenture [for both its new-hire and mid-career consultant hiring], Chase Bank and Merrill Lynch. Ted’s proprietary Select for Success™ hiring skills program has been delivered to scores of clients globally. At McKim & Creed, a civil engineering firm, Ted helped lead a successful C-suite transition. Ted’s core professional interests center on helping individuals and organizations achieve high performance in ways that bring full personal development, team and organizational well-being and a positive impact on society. A current research and consulting interest is leveraging the dynamics that drive superior performance, high ethics and positive treatment of stakeholders, including employees and customers. Ted is also Chief Learning Officer for Choosing High Performance™, a consultancy for helping clients achieve high performance and well-being. Ted recently wrote an element [a digital chapter] for Cambridge University Press’s extensive new series, Reinventing Capitalism in the 21st century. The element is titled, “The Failure of Shareholder Value Theory and the Contours of a Humane Capitalism.” It will be published soon. Ted has been asked to write another chapter for the series, which will provide a roadmap for Boards and CEOs who are striving to transform their organizations from a focus on shareholder value to that of being purpose-driven for the well-being of all stakeholders. Ted has served on various boards, including the Episcopal Church Foundation, Hollow Rock Racquet and Swim Club, and the Rick Herrema Foundation, a non-profit near Fort Bragg in NC, serving military families. On these Boards, Ted served as Chair of the Governance and Strategy Committees. Ted has also worked with US Special Forces officers on ethical leadership and coaching. Ted earned a B.A., High Honors, at Wheaton College (Ill.) in Philosophy and Anthropology; a Master of Divinity, at Princeton Theological Seminary, with a focus on Counseling and Developmental Psychology; a Ph.D. at Columbia University, in Clinical, Vocational and Organizational Psychology; and did Ph.D. studies at Princeton University, in Ethics, Personality, Society & Culture. Appointments and Affiliations Executive in Residence in the Engineering Graduate and Professional Programs Contact Information Office Location: 305 Teer Engineering, Box 90271, Durham, NC 27708 Office Phone: +1 919 660 5386 Email Address: theodore.ryan@duke.edu Websites: Fuqua Faculty Profile Education Ph.D. Columbia University, 1977 Courses Taught MENG 540: Management of High Tech Industries EGRMGMT 540: Management of High Tech Industries ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/why-duke": "The Duke Difference: AI and Machine Learning | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply The Duke Difference: AI and Machine Learning Why join Duke AI? Duke's AI Master of Engineering develops technical leaders who are equipped to build our future through AI and machine learning. Students build strong technical skills together with an understanding of how to design and build software products, positioning them to build new AI products and systems that solve the challenging problems our world faces. Our unique program differentiates itself through: A strong focus on applied machine learning and MLOps to solve real-world problems An experiential model of education where students learn by doing, building a portfolio of personal and team projects to show potential employers A heavy emphasis on industry collaboration , with students engaging with industry leaders during their capstone projects, industry seminars, and internships A small, intimate cohort and emphasis on small class sizes and close interaction between students and our leading faculty We welcome Diverse participants The Duke AI program is designed for engineers and scientists from all regions of the world with a variety of technical and scientific backgrounds. We intentionally cultivate a diverse group of students passionate about several different fields and industries. Roughly half of our students join the program directly after their undergraduate studies, and the other half join after gaining work experience. Many students enter the program with a strong prior background in programming or software development, while others enter with less programming experience but stronger domain-specific expertise. The unique design of our program accommodates both types of participants. Browse student profiles: Eduardo Martinez, Class of 2022 Shyamal Anadkat, Class of 2022 Christine Park & Miranda Morris, Barr-Spach Scholarship Recipients, Class of 2022 An interdisciplinary experience At Duke Engineering, technical training is combined with management courses, industry seminars, a real-world capstone project and an industry internship to provide a well-rounded educational experience that develops both the hard skills and soft skills needed to succeed. Explore the Curriculum » A Flexible Degree Designed for You On-campus or online Duke has you covered: Study on-campus or online. Start with the summer pre-program online data science and programming boot camp. Finish in as little as 12 months of full-time study through the accelerated course schedule, or stay for a third semester and focus on industry-oriented electives. Browse course descriptions » Partnered with Industry Duke's AI curriculum was created from scratch and designed with heavy input from AI leaders across industries. Our faculty come with experience at the top of the tech industry and in successful startups prior to joining Duke. We work closely with industry partners who provide real-world examples for your Capstone Project experience, including some of the leading large techology, healthcare IT, and retail companies. Meet our faculty » Great Graduate Outcomes Duke’s Pratt School of Engineering is a vibrant teaching and research school set in one of the world's leading universities. Our graduates are a global alumni network of leaders spanning multinational companies, small businesses, and high-growth startups. Duke AI students go into some of the most in-demand and exciting job roles available, such as ML Engineers, AI Engineers, and Data Scientists. Our students join companies across a variety of industries who are leading the way in applying AI/ML to their businesses. Learn about outcomes » Duke: A leader in creating educational programs in emerging fields The Duke AI Master of Engineering program is a part of Duke Engineering's Institute for Enterprise Engineering , which provides high-impact professional education to meet fast-evolving industry needs. These programs draw on Duke Engineering’s research and educational strengths in: Computing Fundamentals AI and Machine Learning Cybersecurity FinTech, including Blockchain Engineering Management Learning opportunities are offered online and on-campus and include degree programs, graduate certificates, online credentials, and short courses. We give working professionals and industry partners powerful tools to improve organizational performance and accelerate product innovation. More about Duke Engineering's Institute for Enterprise Engineering » Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/news": "News | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply News February 09, 2024 | Duke Today The AI Explosion, Explained Duke Engineering faculty contribute to a panel on generative AI, why it's suddenly everywhere, and what lies ahead. December 19, 2023 | Duke Engineering Inaugural Generative AI Hackathon Launches Imaginations Duke Engineering’s inaugural generative AI Hackathon brings student collaboration, creativity and innovation to the latest technical tools November 29, 2023 | Duke Research Blog Putting Stronger Guardrails Around AI Executive-in-Residence Lee Tiedrich, an expert in AI law and policy, recently spoke about the new AI executive order and various AI legislative proposals. November 13, 2023 | Duke Engineering Duke’s CREATE Center Joins the AI Revolution in Education The new Center for Research & Engineering of AI Technology in Education seeks to benefit both educators and learners at Duke and beyond November 10, 2023 | Duke Engineering Bolstering Access to Engineering Graduate School Duke Engineering’s annual Graduate Program Boot Camp inspires, mentors and empowers aspiring engineers from diverse backgrounds. October 17, 2023 | Duke Engineering Adapting to AI in the Classroom How Duke Engineering faculty are working to effectively—and thoughtfully—use generative AI tools. July 19, 2023 | Duke Engineering Unlocking the Future Potential of Living Materials Researchers across campus aim to harness bacteria to engineer adaptive living materials May 15, 2023 | Duke Engineering Duke Engineering Celebrates the Class of 2023 On Sunday, May 14, 2023, Duke Engineering celebrated more than 1,100 graduates from its various programs March 29, 2023 | News & Observer That Selfie You Posted on Instagram? Companies Are Using It in Unethical Ways ECE/CS Professor Cynthia Rudin co-pens an opinion piece arguing for the immediate federal regulation of the acquisition and use of biometrics, which are the physical features that differentiate us such as our faces, voices and fingerprints. February 02, 2023 | Duke Engineering Making Real Impact: Duke Engineering Professional Master's Graduates Duke Engineering's December 2022 professional master's graduates are prepared for careers of deep meaning and broad impact Pages 1 2 3 4 5 next › last » ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/yiran-chen": "Yiran Chen | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Yiran Chen John Cocke Distinguished Professor of Electrical and Computer Engineering Yiran Chen received his B.S. in 1998 and M.S. in 2001 from Tsinghua University, and his Ph.D. in 2005 from Purdue University. In 2010, he joined the University of Pittsburgh as an Assistant Professor. He was promoted to Associate Professor with tenure in 2014, while holding the Bicentennial Alumni Faculty Fellowship. He is currently the John Cocke Distinguished Professor of Electrical and Computer Engineering at Duke University. He is the director of the National Science Foundation (NSF) AI Institute for Edge Computing Leveraging Next-generation Networks (Athena), one of the 25 National AI Institutes in the United States, as well as the NSF Industry-University Cooperative Research Center (IUCRC) for Alternative Sustainable and Intelligent Computing (ASIC), and co-director of the Duke Center for Computational Evolutionary Intelligence (DCEI). His group's research focuses on new memory and storage systems, machine learning and neuromorphic computing systems, and mobile computing. He has supervised, or is currently supervising, more than 60 Ph.D. students and 4 PostDocs throughout his academic career. Twelve of his Ph.D. students have joined faculties at universities in the United States, Turkey, Hong Kong, and China, including four NSF CAREER Awardees. Chen has published one book, more than 600 technical publications, and has been granted 96 US patents. He has been honored with 15 paper awards, including two test-of-time awards, as well as 15 best paper nominations from international journals and conferences. He has received numerous awards for his technical contributions and professional services and is one of only three individuals to have received Technical Achievement Awards from both the IEEE Circuits and Systems Society and the Computer Society, with histories of 75 and 78 years, respectively. He has been a distinguished lecturer for the IEEE Council on Electronic Design Automation (CEDA) and Circuits and Systems Society (CASS), a distinguished visitor of the IEEE Computer Society (CS). He is a Fellow of the AAAS, ACM, IEEE, and NAI, and currently serves as the chair of ACM SIGDA. He was the Editor-in-Chief of the IEEE Circuits and Systems Magazine from 2020 to 2023 and is the inaugural Editor-in-Chief of the IEEE Transactions on Circuits and Systems for Artificial Intelligence (TCASAI). Chen has served as Chairman of the Board, Independent Director, and in other consultancy roles for several startups. Beyond his academic and professional pursuits, Chen is a fervent advocate for the responsible use of AI technologies and champions academic belonging, openness, freedom, and equality. He is a founding member of the steering committee of the Academic Alliance on AI Policy (AAAIP) and a member of the Asian American Scholar Forum (AASF). Appointments and Affiliations John Cocke Distinguished Professor of Electrical and Computer Engineering Professor in the Department of Electrical and Computer Engineering Professor of Computer Science Contact Information Office Location: 405 Wilkison Building, 534 Research Dr., Durham, NC 27705 Office Phone: +1 919 660 1372 Email Address: yiran.chen@duke.edu Websites: Google Scholar Page Duke Center of Computational Evolutionary Intelligence (CEI) NSF AI Institute for Edge Computing Leveraging Next Generation Networks (Athena) NSF IUCRC for Alternative Sustainable and Intelligent Computing (ASIC) Education Ph.D. Purdue University, 2005 Research Interests Emerging memory and storage technologies Embedded systems, CPS, edge computing, and mobile applications Neuromorphic computing, deep learning and system security Low power circuit and system Awards, Honors, and Distinctions Distinguished Visitor. IEEE Computer Society . 2024 Dean's Award for Excellence in Mentoring. Duke University. 2024 Distinguished Lecturer. IEEE Circuits and Systems Society. 2023 Charles A. Desoer Technical Achievement Award. Institute of Electrical and Electronics Engineers (IEEE), Circuits and Systems Society. 2023 Fellow (NAI). National Academy of Inventors. 2023 Edward J. McCluskey Technical Achievement Award. Institute of Electrical and Electronics Engineers (IEEE), Computer Society. 2022 Stansell Family Distinguished Research Award. Pratt School of Engineering, Duke University. 2022 AAAS Fellow. American Association for the Advancement of Science. 2022 Outstanding Electrical and Computer Engineer (OECE) Award. Purdue’s School of Electrical and Computer Engineering. 2021 Clarivate Highly Cited Researchers. Clarivate. 2021 HPCA Hall of Fame. IEEE Computer Society, Technical Committee on Computer Architecture. 2020 ACM Fellow. Association for Computing Machinery. 2020 IEEE Fellow. Institute of Electrical and Electronics Engineers. 2018 Distinguished Lecturer. IEEE Council on Electronic Design Automation. 2018 Outstanding New Faculty Award . ACM’s Special Interest Group on Design Automation (SIGDA). 2014 National Science Foundation CAREER Awards - Multiple Sciences. National Science Foundation (NSF). 2013 Courses Taught ECE 899: Special Readings in Electrical Engineering ECE 891: Internship ECE 661: Computer Engineering Machine Learning and Deep Neural Nets ECE 590: Advanced Topics in Electrical and Computer Engineering ECE 392: Projects in Electrical and Computer Engineering COMPSCI 393: Research Independent Study In the News Duke Awards 44 Distinguished Professorships (May 4, 2023 | Duke Today) Three Duke Faculty Elected AAAS Fellows (Jan 31, 2023 | Duke Today) NSF Launches Artificial Intelligence Research Center at Duke (Jul 29, 2021) Yiran Chen: Integrating Tomorrows Technology into Todays Devices (Jan 3, 2017) Representative Publications Yang, X; Wang, Z; Hu, XS; Kim, CH; Yu, S; Pajic, M; Manohar, R; Chen, Y; Li, HH, Neuro-Symbolic Computing: Advancements and Challenges in Hardware-Software Co-Design , IEEE Transactions on Circuits and Systems II: Express Briefs, vol 71 no. 3 (2024), pp. 1683-1689 [ 10.1109/TCSII.2023.3336251 ] [ abs ]. Chang, CC; Pan, J; Xie, Z; Zhang, T; Hu, J; Chen, Y, Toward Fully Automated Machine Learning for Routability Estimator Development , IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol 43 no. 3 (2024), pp. 970-982 [ 10.1109/TCAD.2023.3330818 ] [ abs ]. Chen, Y; Banerjee, S; Daily, S; Krolik, J; Li, H; Limbrick, D; Pajic, M; Runton, R; Zhong, L, Athena – The NSF AI Institute for Edge Computing , AI Magazine, vol 45 no. 1 (2024), pp. 15-21 [ 10.1002/aaai.12147 ] [ abs ]. Chen, F; Chen, Y, An Interview with Dr. Nicky Lu [Interview] , IEEE Circuits and Systems Magazine, vol 24 no. 1 (2024), pp. 6-12 [ 10.1109/MCAS.2023.3332200 ] [ abs ]. Li, S; Wang, Y; Hanson, E; Chang, A; Ki, YS; Li, HH; Chen, Y, NDRec: A Near-Data Processing System for Training Large-Scale Recommendation Models , IEEE Transactions on Computers (2024) [ 10.1109/TC.2024.3365939 ] [ abs ]. ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/natalia-summerville": "Natalia Summerville | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Natalia Summerville Adjunct Associate Professor in the Engineering Graduate and Professional Programs Dr. Natalia Summerville leads a team at SAS Institute, in Advanced Analytics R&D, that designs, develops, and implements Machine Learning and Optimization applications for a variety of industries including Retail, Health Care, Transportation, Manufacturing and Media Advertising. Natalia has been teaching undergrad and masters-level classes in Industrial Engineering, Operations Research and Data Analytics since 2005 and is currently a Lecturer at MIT, Duke University and NCSU. She is deeply passionate about Data4Good movement and has been collaborating with many non-profit and mission-driven organizations to implement data analytics for social good. Natalia is currently a board member within \"Pro-Bono Analytics\" and \"Doing Good with Good OR\" committees at INFORMS. Appointments and Affiliations Adjunct Associate Professor in the Engineering Graduate and Professional Programs Contact Information Email Address: summerville.natalia@duke.edu Websites: LinkedIn Profile Education D.R. North Carolina State University, 2012 Courses Taught AIPI 530: Optimization in Practice Representative Publications Reis Pinheiro, CA; Galati, M; Summerville, N; Lambrecht, M, Using Network Analysis and Machine Learning to Identify Virus Spread Trends in COVID-19 , Big Data Research, vol 25 (2021) [ 10.1016/j.bdr.2021.100242 ] [ abs ]. Summerville, N; Uzsoy, R; Gaytán, J, A random keys genetic algorithm for a bicriterion project selection and scheduling problem , International Journal of Planning and Scheduling, vol 2 no. 2 (2015), pp. 110-110 [ 10.1504/ijps.2015.072105 ] [ abs ]. ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/degree": "Duke's AI Master of Engineering | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Duke's AI Master of Engineering Duke's program is recognized as one of the top applied AI/ML graduate programs in the world Our Master of Engineering in Artificial Intelligence for Product Innovation students develop strong technical skills in AI and machine learning coupled with a deep understanding of how to design and build AI-powered software products. Graduates go on to work in leading companies solving challenging problems across many industries—including tech, healthcare, energy, retail, transportation, and finance. Some of our students go on to found their own entrepreneurial ventures. At Duke, you'll learn to: Design and develop machine learning systems for scale, security and usability Apply traditional machine learning and deep learning models to solve challenging problems across domains Build full-stack software applications integrating machine learning models utilizing the latest methods and technologies Design and deploy software applications in production This program may be for you if you have an educational or work background in engineering, science or technology and aspire to a career working hands-on in AI. See our application requirements for details. • Industry-Connected Curriculum • Flexibility and Options • Curriculum Schedules • Degree Requirements • Compare Online and On-Campus • Cost to Attend and More • Join our Mailing List Industry-connected Curriculum This degree's core curriculum was developed in collaboration with the industry. Build a personal portfolio of real-world, hands-on AI and machine-learning projects Receive individual advising , academic and career, from outstanding, world-class faculty Be engaged with peers from around the world as part of a small, intimate, and immersive cohort We prepare graduates who are ready to solve problems on the job, starting on Day 1. Our curriculum covers the theory and application of AI and machine learning, heavily emphasizing hands-on learning via real-world problems and projects in each course. Students also have two opportunities to work directly with industry leaders during the program: through the semester-long industry project and their summer internship. Flexibility and Options 12 or 16 months on-campus or 24 months online Innovative and immersive, you can complete this Duke master's degree in 12 or 16 months on-campus, or online part-time in just 24 months. 12-Month Accelerated Option Significantly more affordable than a traditional master's program—in this option, pay tuition for only two (2) full semesters plus three (3) summer session credits. 16-Month Standard Track Pursue this degree over three (3) full semesters plus the summer session—allowing you time to take additional electives and specialize. Students pursuing this path may take a partial or whole load of courses during their final semester. 4+1: BSE+Master's Option for Duke Undergraduates Duke undergraduate students can complete undergrad and this master's degree in just five (5) years. Scholarship opportunity: The AI 4+1 BSE+Master's scholarship covers 20 percent of the costs. Eligibility and other conditions apply. MD+MEng in Artificial Intelligence Dual Degree Medical students at Duke can complete this degree during their third year. See Duke MEDx website and School of Medicine bulletin for details. Scholarship opportunity: The MD+MEng AI scholarship covers 20 percent of the costs. Eligibility and other conditions apply. Curriculum Schedules The core of the curriculum follows a cohort-based course sequence On-Campus Accelerated Option: 12 Months Summer Fall Spring Summer Pre-requisite AIPI 503: Python & Data Science Math Bootcamp AIPI 510: Sourcing Data for Analytics MENG 540: Management of High-tech Industries AIPI 560: Legal, Societal & Ethical Implications of AI AIPI 520: Modeling Process & Algorithms AIPI 540: Deep Learning Applications AIPI 561: Operationalizing AI (MLOps) AIPI Departmental Elective AIPI 549: Industry Capstone Project Industry Internship or Project MENG 570: Business Fundamentals for Engineers Technical Elective 1 AIPI 501: Industry Seminar Series Technical Elective 2 EGR 590: Career Strategy & Design On-Campus Standard Track: 16 Months Summer Fall 1 Spring Summer Fall 2 Pre-requisite— AIPI 503: Python & Data Science Math Bootcamp AIPI 510: Sourcing Data for Analytics AIPI 540: Deep Learning Applications AIPI 560: Legal, Societal & Ethical Implications of AI AIPI Departmental Elective AIPI 520: Modeling Process & Algorithms AIPI 549: Industry Capstone Project AIPI 561: Operationalizing AI (MLOps) Technical Elective 2 MENG 570: Business Fundamentals for Engineers MENG 540: Management of High-Tech Industries Industry Internship or Project AIPI 501: Industry Seminar Series Technical Elective 1 EGR 590: Career Strategy & Design Part-Time Online: 24 Months Pre-Program Year 1 Summer Fall Spring Summer Pre-requisite AIPI 503: Python & Data Science Math Bootcamp AIPI 510: Sourcing Data for Analytics AIPI 520: Modeling Process & Algorithms AIPI 540: Deep Learning Applications MENG 570: Business Fundamentals for Engineers MENG 540: Management of High-Tech Industries AIPI 501: Industry Seminar Series On-Campus Residency Year 2 Fall Spring Summer AIPI Departmental Elective AIPI 549: Industry Capstone Project AIPI 560: Legal, Societal & Ethical Implications of AI Technical Elective 1 Technical Elective 2 AIPI 561: Operationalizing AI (MLOps) On-Campus Residency Degree Requirements Pre-Program Bootcamp Summer Online Python & Data Science Math Boot Camp More » 10 Courses Four (4) Technical AI/ML courses —a strong technical foundation Three (3) Product Development courses —developed with Duke's Law School and Fuqua School of Business including the business, legal & ethical aspects of AI products Three (3) Technical electives —specialize in preparation for your chosen career Browse course descriptions » 2 Industry Experiences Industry project —design a solution to an authentic opportunity offered by a sponsoring organization A summer internship or industry project —gain industry experience More » Additional Requirements Learn from leaders building AI products during regular industry seminars Jump-start your professional development with our Career Strategy and Design workshop for on-campus students Meet peers and faculty during two (2) required residencies on the Duke campus for online students The choice of online or on-campus is up to you—all students take the same courses, learn from the same faculty, and earn the same Duke degree. Compare Online and On-Campus Item Online (part-time) On-Campus (full-time) Time to Degree 24 months 12 months or 16 months Python & Data Science Math Boot Camp Online 4-week part-time Online 4-week part-time Class Experience Live and recorded classes Online interaction with faculty and peers Class attendance at Duke In-person and online interaction with faculty and peers Professional Development Two spring residences on-campus at Duke Industry seminar series Industry seminar series Academic Advising Online interaction with a faculty advisor In-person interaction during on-campus residencies In-person and online interaction with a faculty advisor Career Services & Professional Development Support from career services professionals specialized in assisting engineering master's students Support from career services professionals specialized in assisting engineering master's students 6-week Career Strategy and Design workshop Cost of Attendance & More Details Campus Master's Program 2024-2025 Campus Tuition, Fees, and Estimated Expenses Tuition for campus-based Duke Master of Engineering programs for the 2024-2025 academic year is $32,990 per semester taken at the university. Tuition for the Master of Engineering in AI over two semesters and a summer session would result in a total tuition cost of $75,877. The internship course does not incur tuition charges. Item Fall 2024 Spring 2025 Summer 2025 Tuition* $32,990 $32,990 $9,897 Health Fee $487 $487 $225 Health Insurance $3,381 ** Graduate Student Activity Fee $18 $18 Graduate Student Service Fee $12 $ 12 Transcript Fee $120 Recreation Fee $190 $190 Room $6,008 $7,510 $4,506 Board $1,880 $2,350 $1,410 Books & Supplies $322 $322 $167 Local Transportation $904 $1,130 $678 Personal & Misc. $1,896 $2,370 $1,422 Total Cost of Attendance per semester $48,208 $47,379 $18,305 Total Cost of Attendance per academic year $113,892 *Tuition, fees, and estimates are subject to confirmation each May Duration The normal duration of the Master of Engineering in AI program is one year of study (2 semesters and a summer session); however, the program can be extended for an additional Fall semester to complete in 16 months. *The estimated tuition cost of the Extended Track is $85,774 - $95,671, depending on number of credits taken in the final semester. The normal load is four courses (12 units) per semester in the first year Tuition, fees, and expense estimates are subject to confirmation each May Purchase of health insurance is required unless you can show proof of comparable private insurance coverage Online Master's Program Tuition for online Duke Master of Engineering programs for the 2024-2025 academic year is $9,897 per course taken at the university. In general, completion of the 30 required credits over five semesters would result in a total tuition cost of $98,970. Please note that the internship courses do not incur tuition charges. 2024-2025 Online Tuition, Fees, and Estimated Expenses Item Amount Tuition $98,970 ($19,794 per semester) * Transcript Fee $120 * Books $644 * TOTAL $99,734 Notes * Students typically take two courses per semester. Tuition, fees, and estimates are subject to confirmation each May. Rates subject to change Also: Domestic students can estimate $438 in loan fees per semester if securing student loans. No tuition is charged for course credits received for the internship, internship assessment, or residency courses. There is a room and board fee associated with residency There is no charge for registration for students in Duke Master of Engineering programs. Transcript Fee All entering students will be charged a one-time mandatory fee of $120 for transcripts in the first semester. This fee entitles the student to an unlimited number of Duke transcripts. Payment of Accounts The Office of the Bursar will issue invoices to registered students for tuition, fees, and other charges approximately four to six weeks before the beginning of classes each semester. The total amount due on the invoice is payable by the invoice's late payment date, normally one week before the beginning of classes. A student is required to pay all invoices as presented and will be in default if the total amount is not paid in full by the due date. A student in default will not be allowed to receive a transcript of academic records or a diploma at graduation. Contact Duke's Office of the Bursar for: Monthly Payment Option Late Payment Charge Refunds for Withdrawal from School during fall and spring semesters Online Graduate Certificate Program Tuition Tuition for the Graduate Certificate in AI Foundations for Product Innovation in the 2024-2025 academic year is $8,364 per course. There are two semesters per academic year. Therefore, students typically take one course per semester. At current rates, completing the four required courses to earn a stand-alone online certificate would result in a total tuition cost of $33,456. Transcript Fee All entering students will be charged a one-time mandatory fee of $120 for transcripts in the first semester. This fee entitles the student to an unlimited number of Duke transcripts. Not Eligible for VA Benefits or Federal Student Aid These stand-alone online certificate programs are not eligible for VA benefits or federal student aid. Important Note for International Applicants Please Note: This stand-alone online certificate program does NOT qualify students for U.S. visa sponsorship. Gainful Employment Disclosures* Program Length Typically 15 months for AI Foundations for Product Innovation Certificate (1 course per semester, including summer) Program Costs The amounts shown below include costs for the entire program, assuming normal time to completion. There may be additional costs for living expenses. Note that this information is subject to change: Item Amount Tuition $8,364 per 3-credit class, and a total of $33,456 for the certificate ** Transcript Fee $120 ** Books $322 TOTAL $33,898 Notes ** Duke may change its tuition for each academic year, and this estimate is based on current academic year tuition charges Student Loans Information about average student debt, monthly debt expense and debt interest rate have been withheld since fewer than 10 students have completed this program Job Placement Rates We are not currently required to calculate a job placement rate for program completers Program graduates are employed in the following fields: Information Technology Manufacturing Science, Technology, Engineering, and Mathematics Transportation, Distribution, and Logistics The program does not meet any licensing requirements Additional Information—Date Created: 3/15/2021 * These disclosures are required by the U.S. Department of Education For more information, please visit meng.duke.edu » Financial Aid Limited merit-based financial aid is available to highly qualified candidates through academic scholarships emphasizing increasing diversity within the program. U.S. Citizens or Permanent Residents who are underrepresented minorities may receive up to 50 percent per year in tuition scholarships through our Diversity Scholarships. All applicants to the AI program are considered for available financial assistance at the time of program application. More information is available at meng.duke.edu » Duke Undergrads: 4+1: BSE+Master's The Pratt School of Engineering's 4+1: BSE+Master option allows Duke students to earn an undergraduate degree and a master's in five years. Students may choose to start the Master of Engineering in Artificial Intelligence (AI MEng) during their undergraduate senior year. Students who receive admission to the AI MEng program through 4+1 may allocate up to four (4) graduate courses taken in their senior year toward Master of Engineering requirements. In addition, participating students may take graduate-level electives or AI MEng core courses in their senior year. This provides greater flexibility when scheduling the fifth year, and Duke 4+1 students are eligible for the AI MEng Duke 4+1 scholarship. Further details may be found on the 4+1: BSE+Master's webpage . To discuss AI MEng course options for senior year, contact program director Jon Reifschneider at jon.reifschneider@duke.edu . Join Our Mailing List Sign up for timely information on upcoming events, deadlines, and tips on applying: Loading... ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/jon-reifschneider": "Jon Reifschneider | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Jon Reifschneider Director, AI for Product Innovation Master of Engineering Program Jon Reifschneider is the Executive Director of Duke's Artificial Intelligence for Product Innovation Master's Program and teaches in it. Prior to joining the Duke faculty, Jon spent 15 years in management roles at data services and analytics companies. Most recently Jon ran the Weather Analytics division at the tech company DTN, where he and his team created predictive analytics systems that are now core to the daily operations of most of the largest transportation, aviation and energy utility organizations across the US and globally. As a member of the DTN executive team, he led his division through a period of substantial expansion and completed the successful sale of the company in 2017. Jon holds a B.S. in Mechanical Engineering from the University of Virginia where he graduated first in his class, a Master of Engineering Management from Duke University, a M.S. in Analytics from Georgia Tech, and a Global MBA from EBS (Germany). He has lived, worked and studied in the United States, Luxembourg, Germany and India. Appointments and Affiliations Executive in Residence in the Engineering Graduate and Professional Programs Executive Director of the Master of Engineering in Artificial Intelligence for Product Innovation Program Contact Information Email Address: jon.reifschneider@duke.edu Websites: Personal Website MEng in AI for Product Innovation Program Duke Intelligent Learning Lab Courses Taught MENG 552: Master of Engineering Supplemental Internship MENG 551: Master of Engineering Internship/Project Assessment MENG 550: Master of Engineering Internship/Project IDS 790: Special Topics in Interdisciplinary Data Science AIPI 591: Special Readings in AI for Product Innovation AIPI 590: Advanced Topics in AI for Product Innovation AIPI 549: Capstone Practicum 1 AIPI 540: Deep Learning Applications AIPI 520: Modeling Process and Algorithms AIPI 510: Sourcing Data for Analytics AIPI 505: Mid-Program Residency AIPI 504: Introductory Residency AIPI 501: AIPI Seminar In the News Engineering Faculty Help Students Adapt to AI in the Classroom (Oct 20, 2023 | Pratt School of Engineering) New Master's Program Applies AI to Product Innovation (Aug 12, 2020) Duke Launches Graduate Certificate in AI for Product Innovation (Jun 1, 2020 | Pratt School of Engineering) ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/courses": "AI Master of Engineering Courses | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply AI Master of Engineering Courses Our novel curriculum gives students the skill set they need to build innovative AI-based products and systems Pre-Program Preparation AIPI 503: Python & Data Science Bootcamp This four-week online bootcamp will help you build proficiency in the use of Python for data science as well as basic software engineering principles and tools. It covers foundational concepts and provides hands-on experience with critical skills including loading, cleaning, manipulating, visualizing, analyzing and interpreting data. Upon completion of the bootcamp, you will have the skills to identify, formulate and solve practical data analysis problems using Python. The first two weekly modules are an introduction to basic Python data structures and control flow. From there, students will build proficiency with three Python libraries critical for data science: NumPy, Pandas, and Matplotlib. Students who are proficient in Python as well as the data science libraries listed may request to test out of the bootcamp. Waivers are granted at the program director’s discretion upon successfully completing the proficiency test. Technical Core AIPI 510: Sourcing Data for Analytics In industry, one of the main activities, and challenges, of implementing machine learning applications are collecting data to use in modeling. This course introduces students to methods and tools used for data collection, storage, manipulation, analysis and visualization. The first segment of the course will be an introduction to numerical programming focused on building skills in working with data via the Numpy and Pandas libraries, two of the most common tools used by teams working with data and modeling. Technical aspects covered will include the types of data, methods of sourcing data via the web, APIs, and from domain-specific sensors and hardware (IoT devices), an increasingly common source of analytics data in technical industries. The course also introduces methods and tools for evaluating the quality of data, performing basic exploratory data analysis, and pre-processing data for use in analytics. Non-technical aspects covered include an introduction to data privacy, GDPR, regulatory issues, bias, and industry-specific concerns regarding data usage. AIPI 520: Modeling Process & Algorithms This course is an introduction to the modeling process and best practices in model creation, interpretation, validation, and selection of models for different uses. The primary machine learning algorithms, both supervised and unsupervised, are introduced and students become familiar with both the mathematical theory and the programming application of the models. The primary focus is on statistical learning approaches but the course also introduces deep learning and its applications. At the end of this course, students should have a solid understanding of the end-to-end modeling process and the different types of model algorithms along with the strengths, weaknesses, assumptions, and use cases for each type, and be capable of training and using models in Python. Students who have taken one or more prior machine learning courses in their undergraduate institution will have the option to take an additional technical elective instead of AIPI 520. AIPI 540: Deep Learning Applications This course focuses on the primary use cases of deep learning to solve challenging problems particularly in the areas of computer vision, natural language processing and recommendation systems. Students will develop an understanding of both the mathematical theory and programmatic implementation of neural networks using Python. The course includes significant hands-on team-based project work and an emphasis on self-discovery. The semester will be split into three core modules: computer vision, NLP, and recommendation systems. Each module will include lectures, assignments, a team project, and a review of recent research in the field. AIPI 561: Operationalizing AI (MLOps) Deploying AI in production requires consideration of factors such as online model training, scaling, integration with software/hardware products, monitoring/support, security and failure resiliency. This course introduces students via real-world case studies to methods and best practices in deploying AI operationally within products and services, including both technology and support infrastructure considerations. The course will also introduce available technologies for working with Big Data in industries that require specialized infrastructure and tools due to the volume of data. AIPI 501: Industry Seminar Series Students will attend a weekly seminar series featuring industry leaders discussing the opportunities, challenges and learnings they have gained from applying AI to products and services in their industry. Speakers will present live in-classroom or via video conference. The emphasis in the selection of speakers will be placed on representing more traditional industries that are poised to be disrupted by AI such as agriculture, health care/biotech, energy and environment, and manufacturing. The seminar series will reinforce the concepts learned in the core courses and expand students’ intuition for the opportunities to apply AI within more complex and/or traditional industries. Product development Core AIPI 560: Legal, Societal & Ethical Implications of AI Deploying AI within products and services has implications well beyond the technical considerations, which often include change management of operational workflows or staffing levels, data privacy considerations, bias risks and other ethical implications, and industry-specific regulations on the use of data and models operationally. This course will introduce students to the key areas of consideration when deploying products that contain AI: Legal implications and industry regulation Ethical considerations Change management and organizational/societal implications Case studies will be used extensively to provide real-world examples. MENG 540: Management of High-Tech Industries The purpose of this course is to empower students to become collaborative, ethical leaders in the globalized, 21st-century workplace. Students learn concepts and practice skills that will enable them to transition from being an engineering sole contributor to managing and leading others as a business professional. Students gain a sound understanding of management and leadership; increase awareness of their own management and leadership styles; build and practice competencies essential for team success (e.g., effective communication, collaboration, conflict resolution); and become ethical leaders above reproach. Emphasis is on leading teams in a volatile, complex and interdependent world. MENG 570: Business Fundamentals for Engineers This comprehensive course examines core and evolving concepts in the business fundamentals of successful technology-based companies including Business Plan Development & Strategies, Marketing, Product & Process Development processes, Intellectual Property, Accounting, Finance, and Operations. Students will learn the fundamentals essential to understanding all aspects of a business and will be able to converse in some depth in each of the areas studied upon completion. Other topics will include Supply Chain Management, Stage-Gate Development Cycles, Balances Scorecards, Blue Ocean Strategy, and Disruptive Technologies. Elective Options (Select Three) Note: In addition to the courses listed below, students in this master's degree program may take other graduate-level elective courses within Duke's Pratt School of Engineering, on a space-available basis with instructor permission. At least one elective must be taken through the AI MEng program. AIPI Departmental Electives AIPI 530: Optimization in Practice Optimization is the ultimate skill in artificial intelligence and prescriptive analytics allowing practitioners to generate the best actionable solutions for business needs. This class will give students required skills to mathematically formulate relevant business problems as optimization models, use leading software modeling syntax and solvers to generate optimum solutions and meaningfully interpret these solutions. We will use both SAS/Optmodel and Python/Pyomo to give student experience with proprietary and open-source optimization software. Focus will be on problem formulation and results interpretation. AIPI 531: Deep Reinforcement Learning Applications This course will cover advanced sequential decision-making topics in AI and will consist of two parts: 1) deep reinforcement learning theory and 2) deep reinforcement learning applications. Deep reinforcement learning combines reinforcement learning and deep learning. The theory module will introduce students to major deep reinforcement learning algorithms, modeling process, and programming. The applications module will include case studies on the practical applications of deep reinforcement learning in industry. This is a project-based course with extensive Pytorch/Tensorflow hands-on exercises. Students will also have an opportunity to improve their GitHub profile by working on projects. AIPI 571 / IDS 721: Data Analysis at Scale in the Cloud This course is designed to give students a comprehensive view of cloud computing including Big Data and Machine Learning. A variety of learning resources will be used including interactive labs on Cloud Platforms (Google, AWS, Azure). This is a project-based course with extensive hands-on assignments. AIPI 590-01: Large Language Models for Generative AI This course focuses on the emerging field of Generative AI with specific emphasis on Large Language Models (LLMs). Both the theory and practical application of LLMs will be covered, with significant hands-on project work. Students will work with LLMs to develop software applications and in the process will gain an understanding of the opportunities, limitations, and practical strategies for implementing generative AI effectively. The course will also explore the nature of generative AI models relative to human intelligence, the role that generative AI plays in the path towards artificial general intelligence (AGI), and the opportunities and risks that the current trajectory of generative AI development is creating. AIPI 590-02: Applied Computer Vision Computer vision is a rapidly evolving field with broad applications in industries ranging from healthcare and automotive to entertainment and agriculture. This course is designed to equip students with the knowledge and practical skills required to understand, develop, and deploy deep learning based computer vision systems for solving real-world problems. Students will delve into the fundamental concepts of computer vision, gain hands-on experience with state-of-the-art tools and libraries, and work on projects that tackle real-world challenges. Topics covered include image classification, object detection, segmentation and generation. Emphasis will be placed on building scalable data and modeling pipelines suitable for real-world application. AIPI 590-03: Emerging Trends in Explainable AI This course introduces students to emerging trends in XAI (Explainable AI), including Human-AI interaction, ML interpretability and transparency techniques, adversarial attacks and defenses, and red-teaming. Discussions around the regulatory landscape, ethical considerations, and security will be balanced with hands-on experience with emerging tools and approaches in XAI. Additional Technical Electives BIOSTAT 709: Observational Studies Methods for causal inference, including confounding and selection bias in observational or quasi-experimental research designs, propensity score methodology, instrumental variables and methods for non-compliance in randomized clinical trials. BME 580: Biomedical Data Science This course will teach a combination of theory and application of biomedical data science principles using multi-scale biomedical data; including multi-omics, wearable sensor, and electronic health records data. Basic principles of data mining, exploratory data analysis, and statistics will be reviewed, and students will be introduced to supervised and unsupervised machine learning and model evaluation and selection methods. Methodology learned in classes will be applied in the assignments and class project to real-world multi-omics, wearable sensor, and electronic health records data. CYBERSEC 511: Cybersecurity in the Software Development Lifecycle Teaches students about all steps of the software development lifecycle and the role Cybersecurity design principles play in requirements definition, design, development, testing, and maintenance. Tools and techniques to provide software security analysis and software assurance will be explored including software reverse engineering. CYBERSEC 520: Applying Machine Learning to Advance Cybersecurity The use of machine learning and AI is becoming more prevalent for collecting and analyzing data as its consolidation increases in value. Cyberattacks seek to steal, deny access, misrepresent (such as deepfakes), or compromise the privacy of information. Students will explore the power of machine learning and AI’s use in enhancing Cybersecurity tools across the NIST Framework and also in detecting and exploiting vulnerabilities in timeframes and ways heretofore unthinkable. ECE 564: Mobile App Development Explores the world of mobile application development with a focus on the needs of engineers. Centered on the Apple environment, with the development environment being on OS X and the target environment being an iOS device- iPad, iPhone, iPod Touch or Apple Watch. Real-world- and context-focused on the common programming patterns for engineers in academia or business- standalone apps, apps connected to other systems, apps connected to the cloud. Covers fundamentals essential to understanding all aspects of app development. Taught in a team environment. Students are required to present their project proposals and deliver an app as a final project. ECE 663: ML in Adversarial Settings Machine learning is being widely deployed in many aspects of our society. Our vision is that machine learning systems will become a new attack surface and attackers will exploit the vulnerabilities in machine learning algorithms and systems to subvert their security and privacy. In this course, we will discuss security and privacy attacks to machine learning systems and state-of-the-art defenses against them. ECE 682D: Probabilistic Machine Learning Introduction to concepts in probabilistic machine learning with a focus on discriminative and hierarchical generative models. Topics include directed and undirected graphical models, kernel methods, exact and approximate parameter estimation methods, and structure learning. The course assumes a prior background in linear algebra and probability and statistics. EGRMGMT 575: Software Quality Management This class will introduce students to five different business personas that play a key role in the software development lifecycle—customer, software engineer, software release/quality manager, customer support engineer, and general manager. The students will better appreciate the perspectives that each of these personas brings to their role and how that affects the \"delivered\" quality that customers actually experience. The course will also help students understand how to assess customer business outcomes, expectations and measure customer experience. Finally, the class will provide exposure to current industry practices and include guest speakers who can give real-world examples relevant to software quality management. EGRMGMT 590-01: Software, Solution & Enterprise Architecture Students learn the concepts and principles about how a software system is constructed at the highest level. Software architecture is the fundamental design of the entire system. It defines what elements are included in the system, what function each element has, and how each element relates to one another. In short, it is the big picture or overall structure of the whole system, how the enterprise technology system works together. Having a clear design of the overall system as a starting point helps to provide a solid basis for developers to follow and it allows higher productivity and software quality. Students immerse themselves into architecture understanding from multiple perspectives through various UML diagrams including different software architectures frameworks, when and how they are used, their advantages and disadvantages. Software architecture is tied to many practical business concerns. These include the skills and organization of the software engineering team, the needs of the business, the development cycle, and the intent of the software itself. EGRMGMT 590-03: Software Business Management In today’s world software is pervasive in most if not all companies. A software business is a commercial activity aimed at producing, buying, and selling software products or services. Well-run software companies are known for their high profit margins. This course will focus on understanding the key success factors for software organizations to drive their portfolio strategy by mapping out monetization models, pricing, vendor management, professional services, development & continuous delivery, road mapping & maintenance. EGRMGMT 590-05: Software Business Management In today’s world software is pervasive in most if not all companies. A software business is a commercial activity aimed at producing, buying, and selling software products or services. Well-run software companies are known for their high profit margins. This course will focus on understanding the key success factors for software organizations to drive their portfolio strategy by mapping out monetization models, pricing, vendor management, professional services, development & continuous delivery, road mapping & maintenance. STA 640: Causal Inference Statistical issues in causality and methods for estimating causal effects. Randomized designs and alternative designs and methods for when randomization is infeasible: matching methods, propensity scores, longitudinal treatments, regression discontinuity, instrumental variables, and principal stratification. Methods are motivated by examples from social sciences, policy and health sciences. STA 663: Statistical Computation Statistical modeling and machine learning involving large data sets and challenging computation. Data pipelines and data bases, big data tools, sequential algorithms and subsampling methods for massive data sets, efficient programming for multi-core and cluster machines, including topics drawn from GPU programming, cloud computing, Map/Reduce and general tools of distributed computing environments. Intense use of statistical and data manipulation software will be required. Data from areas such as astronomy, genomics, finance, social media, networks, neuroscience. Industry Project AIPI 549: Industry Project Students will work in teams of 3-5 to complete a Machine Learning/Artificial Intelligence project for a company sponsor around a real-world problem or opportunity they are facing. The project will require students to put into practice many of the skills learned during the program, including both technical and non-technical. Students will have the opportunity to engage directly with representatives from their company partner organization as well as receive guidance from Duke faculty members over the course of the project. The team will present their final deliverables to a sponsor panel and/or an external review panel. Internship or Project MENG 550: Master of Engineering Internship or Project Internships are typically 8-12 weeks. The minimum hourly requirement for the internship is 320 hours, equivalent to 8 weeks, 40 hours per week. Projects require approval from the AIPI program director. Projects must fulfill the same learning objectives as internships. Although students are responsible for finding their own internship, Duke provides an experienced career development team to help with your search. All internships/projects must: Apply engineering principles to solving one or more problems outside the classroom environment Define a problem and determine potential solutions Appreciate the importance of organizational dynamics and work relationships Practice professional communication both written and orally Complement material presented in the AIPI courses Include a self-assessment upon completion in AIPI 551 MENG 551: Master of Engineering Internship or Project Assessment This assessment course is the culmination of your internship or project work. You will prepare a substantive assessment of your internship or project experience via a written report and/or oral presentation. A polished analysis should include: Problem or task conducted Challenges faced Solutions incorporated Workplace communication and interpersonal relationship critique Individual performance review ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/xu-chen": "Xu Chen | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Xu Chen Adjunct Assistant Professor in the Pratt School of Engineering Appointments and Affiliations Adjunct Assistant Professor in the Pratt School of Engineering Contact Information Email Address: xu.chen@duke.edu Education Ph.D. University of Illinois, 2010 B.S. Shanghai Jiao Tong University (China), 2006 Courses Taught AIPI 590: Advanced Topics in AI for Product Innovation ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/why-duke/graduate-outcomes": "Graduate Outcomes | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Graduate Outcomes Boost your career trajectory with Duke AI Master of Engineering Duke AI students go into some of the most in-demand and exciting job roles available. The most common job titles for graduates are: ML Engineer / Senior ML Engineer, AI Engineer, and Data Scientist / Senior Data Scientist. Our program has a 100% placement rate within 6 months of graduation. Our median starting salary for graduates over the past 2 years is $118,000 and compensation varies based on location and prior work experience. Our best-in-class student experience includes access to a dedicated career services team , networking opportunities, and employer recruitment events. Selected Graduate Employers Our students join organizations leading the way in AI/ML OpenAI Target's AI Lab Eli Lilly Grubhub Samsung IBM DoorDash Fidelity Intuit AutoDesk Ancestry Morgan Stanley GE And many more Browse Employment Data See employer names and job roles VIEW DATA Opens in a new window | Best viewed on a wide screen View several years of employment data » Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/faculty/wann-jiun-ma": "Wann-Jiun Ma | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Wann-Jiun Ma Adjunct Assistant Professor in the Engineering Graduate and Professional Programs Wann-Jiun received his PhD in Electrical Engineering from University of Notre Dame in 2015, and then worked as a postdoctoral associate at Duke University. He has been working for both big and startup companies as a data scientist. Currently, he is the Director of Data Science/AI at Neiman Marcus Group. In addition to being a data science practitioner in the industry, he also collaborates with multiple data science MS programs and guides students as they work on their deep reinforcement learning capstone projects. His current research interests are deep learning/deep reinforcement learning/large language models and their real-life applications, especially product recommendations and personalization. Appointments and Affiliations Adjunct Assistant Professor in the Engineering Graduate and Professional Programs Contact Information Email Address: wann.jiun.ma@duke.edu Websites: LinkedIn Education D.Eng. University of Notre Dame, 2015 Research Interests Deep learning/deep reinforcement learning/large language models and their real-life applications. Courses Taught AIPI 591: Special Readings in AI for Product Innovation AIPI 590: Advanced Topics in AI for Products Innovation AIPI 531: Deep Reinforcement Learning Applications AIPI 530: AI in Practice ​ Join our mailing list! Sign up to receive more information about Duke Engineering graduate programs and recruitment events » Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact",
    "https://ai.meng.duke.edu/certificate": "AI Foundations for Product Innovation Graduate Certificate | Duke AI Master of Engineering Jump to navigation Duke Engineering Pratt School of Engineering Institute for Enterprise Engineering Industry Relations Leadership News Contact Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply AI Foundations for Product Innovation Graduate Certificate A 4-course online program in AI and Machine Learning designed for working professionals Those who have knowledge of AI and machine learning have an advantage. Earn this Duke standalone, credit-bearing, non-degree offering in 15 months by completing: A Python and data science math pre-program boot camp Four (4) technical core courses in AI and machine learning Learn online and pay tuition per course , without the commitment of a traditional degree program. Extensive programming experience is not required, but the following are recommended: An undergraduate degree in science or engineering (or equivalent technical work experience); A minimum of one (1) semester of programming (any language); Two (2) semesters of calculus Students who enroll and complete the certificate will have the option to subsequently apply for the online Duke AI Master of Engineering degree (details below). Join our mailing list to receive updates! How to Apply Certificate courses are taught by the same faculty who teach the AI Master of Engineering degree program. courses Semester Course Titles Summer (Pre-Program) Python & Data Science Math Boot Camp Fall 1 AIPI 510: Sourcing Data for Analytics Spring 1 AIPI 520: Modeling Process & Algorithms Summer 1 AIPI 540: Building Products Using Deep Learning Fall 2 Departmental Technical Elective Students who complete the certificate earn credits they can apply toward the online Duke AI Master of Engineering degree. Certificate Program Details Admissions Policies and Practices This certificate program is open to all qualified applicants worldwide. Applications are accepted for the certificate program for the fall semester only, and participants are expected to be working full-time while completing the Certificate program. An application for the AI Foundations for Product Innovation graduate certificate program requires the following: A bachelor’s degree in engineering or science from an accredited institution (transcripts required, including an estimated GPA and a grade scale) Statement of purpose Résumé Two recommendations English Language Testing (TOEFL or IELTS): official results required— international applicants only Video introduction This is a standalone certificate program and does not qualify international students for US visa sponsorship. How to apply Scholarships For students joining the certificate program in the 2023-24 academic year, a limited number of merit-based scholarships are available. All applicants will be automatically considered for the available scholarships based on their application materials. Program Costs The amounts shown below include costs for the entire program, assuming normal time to completion. There may be additional costs for living expenses. Note that this information is subject to change: Tuition $8,043 per 3-credit class, and a total of $32,172 for the certificate ** Transcript Fee $120 ** Books $316 (estimate) TOTAL $32,608 Notes ** Duke may change its tuition for each academic year. This estimate is based on the 2023-24 academic year tuition charges. Applying the Certificate to the Master of Engineering Students who enroll and successfully complete the certificate requirements will have the option to subsequently apply for the online Duke AI for Product Innovation Master of Engineering within four years, and use their certificate courses (12.0 course credits) toward the degree (30.0 course credits), as long as they earn a grade of B or better in each class. Certificate holders who apply to the online Duke AI for Product Innovation Master of Engineering program will additionally be required to provide GRE scores (if required at time of application). GRE scores are optional for the 2023-24 admissions cycle. Applicants who are accepted will then need to complete the remaining requirements for the degree: typically, four electives, two Master of Engineering management core courses, and the required on-campus residencies in Durham, NC. This is not an offer of preferential admission, and there is no guarantee of admission. See our academic policy bulletin for the most current details. Not Eligible for VA Benefits or Federal Student Aid This standalone online certificate program is not yet eligible for VA benefits or federal student aid. Please check back for updates. Important Note for International Applicants Please Note: This standalone online certificate program does NOT qualify students for U.S. visa sponsorship. Gainful Employment Disclosures* Program Length Typically 15 months (1 course per semester, including summer) Student Loans Information about average student debt, monthly debt expense and debt interest rate have been withheld since fewer than 10 students have completed this program Job Placement Rates We are not currently required to calculate a job placement rate for program completers Program graduates are employed in the following fields: Information Technology Manufacturing Science, Technology, Engineering, and Mathematics Transportation, Distribution, and Logistics The program does not meet any licensing requirements Additional Information: Date Created 3/15/2021 * These disclosures are required by the U.S. Department of Education Join Our Mailing list Receive information about this Duke Engineering graduate certificate program and related online recruitment events: Loading... Admissions Have a question about the program or admissions? Contact the Admissions & Recruiting team at pratt_masters@duke.edu . © Copyright 2011-2024 Duke University Main Menu Why Duke? The Duke Difference Career Services Graduate Outcomes What Tech Leaders Are Saying Degree Certificate Courses Faculty Apply Quick Links Industry Relations Leadership News Contact"
}